// app/vellalar/gangai-amman.tsx
import { ScrollView, Text, View, Image, StyleSheet } from 'react-native';
import BackButton from '@/components/BackButton';

export default function GangaiAmmanScreen() {
  return (
    <ScrollView style={styles.container} contentContainerStyle={{ paddingBottom: 40 }}>
    <BackButton/>
      <Image
        source={require('@/assets/images/ganga.jpg')}
        style={styles.image}
        resizeMode="cover"
      />

      <Text style={styles.title}>கங்கை அம்மன் வழிபாடு</Text>

      <Text style={styles.content}>
       தொண்டை மண்டலப் பகுதியில் குறிப்பாக பழைய வட ஆர்க்காடு, காஞ்சிபுரம், செங்கல்பட்டு, திருவண்ணாமலை, தருமபுரி ஒட்டிய பகுதிகளில் ஆண்டு தோறும் சித்திரை, வைகாசி மாதங்களில் கங்கை அம்மன் திருவிழா என்னும் திருவிழா இன்றளவும் சிறப்பாக நடைபெறுகின்றது. கங்கை அம்மன் உடல் மண்ணால் செய்யப்பட்டிருக்கும். அவளது சிரம் தனியாகப் பிறிதொரு கோயிலில் வைக்கப்பட்டிருக்கும். ஒவ்வொரு ஆண்டும் அச்சிரத்தை அவளது உடல் பகுதியில் வைத்து மீண்டும் அத்தலையைப் பிறிதொரு கோயிலில் வைத்து விடுவர். இன்றளவும் இந்நிகழவு தொண்டைமண்டலத்தில் பல பகுதிகளில் கொண்டாடப்பட்டு வருகின்றது. சென்னை பெருநகரில் கங்கையம்மன் கோயிலில் கங்கையின் தலைப்பகுதி மட்டும் வைத்து வணங்குகின்ற வழக்கத்தை இன்றும் காணலாம். கங்கையின் தலை கொய்யப்பட்டதற்கு பிறிதொரு புராணத்தை மக்கள் சொல்வர். இருப்பினும் கங்கையம்மன் வழிபாடு இப்பகுதியில் மிகத் தொன்மையானது. வேளாண்குடிகளால் பெரிதும் வணங்கப்பட்ட மூதாதையர் வழிபாடு என்பது தொல்லியல் அடிப்படையில் உறுதி செய்யலாம். 
        {'\n\n'}
        மேற்சொன்னபடி புதியகற்காலத்தில் இனக்குழுவாக செயல்பட்ட கால்நடை மேய்ப்பு வேளாண் சமூகத்தினரால் வேளாண்மை தொண்டைமண்டலத்தில் உருவாகியது என்பதையும் இரும்புக்காலத்தில் வேளாண்மை பெரிதும் வளர்ச்சி பெற்றது என்பதையும் முன்னர் கண்டோம். இக்காலகட்டத்தில் இறந்தவர்களை புதைத்து பல்வேறு ஈமச்சின்னங்களை மக்கள் உருவாக்கினர். அச்சின்னப்பகுதிகளில் தாய்த்தெய்வத்திற்கான உருவத்தைக் கற்பலகைகளில் வடித்து அதனை வணங்கும் வழக்கம் ஏற்பட்டது. அத்தகைய தொன்மை சிற்ப உருவங்கள் தமிழகத்தில் வேளாளர் செழித்தோங்கிய திருவண்ணாமலை பகுதியில் மோட்டூர் என்ற இடத்திலும் கம்பர் ஆதரித்த சடையப்ப முதலியின் புகழ்பெற்ற ஊரான திருக்கோயிலூர் அருகில் உள்ள உடையாநத்தம் என்ற ஊரிலும் கண்டுபிடிக்கப்பட்டன. இதனை தாய்த்தெய்வக் கற்கள் எனத் தொல்லியல் ஆய்வாளர்கள் குறிப்பிடுகின்றனர்.
        {'\n\n'}
        இவற்றின் அமைப்பு தொண்டைமண்டல கங்கையம்மன் கோயில்களில் காணப்படும் தலையற்ற உடல் அமைக்கப்படும் மண் உருவம் போன்றே உள்ளன. இவை அருவுருவ தெய்வங்கள் ஆகும். அருவுருவ வழிபாடு இயற்கை வழிபாட்டிற்கு அடுத்த நிலையில் உருவ வழிபாட்டிற்கு முந்திய நிலையில் தோன்றிய வழிபாட்டு முறையாகும்.   எனவே தொண்டைமண்டலத்தில் மோட்டூர் உடையார் நத்தம் சித்தூர் பகுதிகளில் கிடைக்கின்ற அருவுருவத் தாய்த்தெய்வமே கங்காபுத்திரர் எனப்படும் வேளாளர்களால் மூதாதையர் தெய்வமாக வழிபடப்பட்டிருக்கவேண்டும். பின்னர் உருவ வழிபாடு தோன்றிய காலத்தில் காலப்போக்கில் சிரசு எனப்படும் தலையை உடலுடன் இணைத்து வழிபடுகின்ற முறை இப்பகுதியில் தோன்றியிருக்க வேண்டும்.  கங்கையம்மன் கோயில்கள் தமிழகத்தை ஒட்டிய ஆந்திரப் பகுதியிலும் இன்றளவும் கொண்டாடப்படுகிறது.
        {'\n\n'}
        ஆந்திராவின் சித்தூர், மதனப்பள்ளி போன்ற பகுதிகளிலும் தாய்த்தெய்வக் கற்கள் கிடைத்துள்ளன. இக்கற்களில் உடல்பகுதியில் மார்பகங்கள் காட்டப்பட்டிருப்பதும் இங்கு குறிப்பிடத்தக்கது.  தொடக்க கால உருவ வழிபாட்டில் இத்தாய்த்தெய்வமே தமிழகத்தில் கிடைத்துள்ள தாய்த்தெய்வமாகும்.  இவ்வழிபாடுகள் வேளாளர்களின் தொன்மையான அவைதீக வழிபாட்டு முறைகளாகும், திருமணச் சடங்கிற்கு முன் தங்கள் குல தெய்வங்களை வழிபடும் வழக்கம் உள்ளது. மேலும் முனீஸ்வரன் காட்டேரி தவிர பெண் தெய்வங்களாக பச்சையம்மன், ரேணுகா தேவி போன்ற தெய்வங்களையும் குல தெய்வங்களாக தொண்டை மண்டல துளுவ வேளாளர்கள் வணங்கி வருகின்றனர்.
</Text>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    backgroundColor: '#fff',
    padding: 16,
    textAlign: 'justify'
  },
  image: {
    width: '100%',
    height: 220,
    borderRadius: 16,
    marginBottom: 16,
  },
  title: {
    fontSize: 22,
    fontWeight: 'bold',
    color: '#047857',
    marginBottom: 12,
    textAlign: 'center',
  },
  content: {
    fontSize: 16,
    color: '#333',
    lineHeight: 26,
    textAlign: 'justify',
    width: 343,
    paddingRight: 6
  },
});
