// app/vellalar/gangai-amman.tsx
import { ScrollView, Text, View, Image, StyleSheet } from 'react-native';
import BackButton from '@/components/BackButton';
export default function GangaiMaindhanScreen() {
  return (
    <ScrollView style={styles.container} contentContainerStyle={{ paddingBottom: 40 }}>
  <BackButton/>
      <Image
        source={require('@/assets/images/ganga.jpg')}
        style={styles.image}
        resizeMode="cover"
      />

      <Text style={styles.title}>கங்கை மைந்தன் மரபாளன் காஞ்சியில் குடியேறல்</Text>

      <Text style={styles.content}>
கங்கை மைந்தர்கள் என அழைக்கப்படும் வேளாளர்களின் முன்னோர் மரபாளன் என வழங்கப்படுகின்றார். இவர் கங்கை மைந்தராவார். சிவபெருமான் வேளாளர் வரலாற்றை நந்தி தேவர்க்கு எடுத்துரைக்கின்றார். வழி வழியாக இப்புராண வரலாறு பல்வேறு முனிவர்களுக்கும் சொல்லப்படுகிறது.   மேழிச் (ஏர்க்கலப்பை)  செல்வத்தை தருகின்ற மரபாளன் திருவேணி சங்கமத்தில் உறைகின்ற கங்கா தேவிக்கு மகனாகப் பிறக்கின்றார்.  இளமைப்பருவம் கழிந்து அவரை உலகம் உய்ய வேளாண்மைத் தொழிலைச் செய்யும் பொருட்டு காஞ்சி மாநகருக்கு அனுப்பி வைக்கின்றனர். அவர் அப்பகுதியில் காடு திருத்தி நாடாக்கி தமக்குப் பிறந்த 55 ஆண் குழந்தைகளையும் 51 பெண் குழந்தைகளையும் பல பகுதிகளின் தலைவர்களாக நியமித்தும் பெண்களைப் பல்வேறு அரச குலத்தவருக்கு மணமுடித்தும் வேளாண்மையைப் பெருக்க நிலப்பரப்புகளை ஆட்சி செய்யப் பணிக்கின்றார்.         
{'\n\n'}
வேளாளர் குலத்தில் உதித்த மரபாளன் கங்கையின் மைந்தன் என்ற வகையில் கங்கை புதல்வன் என்றும் பூமியை வளப்படுத்தி வேளாண்மைக்கு உட்படுத்தியமையால் பூமிபுத்திரர் என்றும், வேள் என்பதற்கு நன்னிலம், நன்றி, நன்றியறிதல், ஈகை, உண்மை  என்பது பொருளாகும். எனவே வேளாளர் என வழங்கப்பட்டனர்.  வேளாளர்கள் கங்காபுத்திரர் என்பதை கவிச்சக்ரவர்த்தி கம்பர் அவர்களும்  ”கங்கை பெறுங் காராளர் கருவி யெழுபதுமுரைக்க” எனக் குறிப்பிடுகின்றார்.        
{'\n\n'}
வேளாளர் இவற்றின் இலக்கணமாய் விளங்கியதால் வேளாளன் என்று அழைக்கப்பட்டனர். வெள்ளத்தை கட்டுப்படுத்தி அதனை ஆட்சி செய்தமையால் வெள்ளாளன் என்றும் கார் மேகங்களைக் காப்பாற்றியமையால் காராளன் (கார்காத்தார்)  என்றும் வேளாண்மையுடன் கால்நடைகளைப் பேணிக்காத்து வருவதாலும் நிலத்தை உழுது உணவை உற்பத்தி செய்து உலகிற்கு அளிப்பதால் பூபாலன் என்றும் உணவுப் பொருள்களை உற்பத்தி செய்வது மட்டுமல்லாது அதனை சந்தையில் குறைபடாது கொடுத்து மிகைபடாது பெற்று வணிகம் செய்தமையால் வைசியன் (பூவைசியன்) என்றும்  நீர், நிலம், நெடிய களம், ஏர், படை புரிபடை ஆட்கள், நெற்கோட்டை, குவியல் களஞ்சியம் அவற்றை ஏற்றிச் செல்லும்  வண்டி  முதலிய அனைத்து செல்வங்களையும் ஒருங்கே பெற்றமையால் இராயர் என்றும் வழங்கப்பட்டனர்.        
  {'\n\n'}
இதன் அடிப்படையில் காஞ்சியைச் சுற்றியுள்ள தொண்டை மண்டலம் மற்றும் அதன் சுற்றுப் பகுதிகளில் வேளாளர்கள் வேளாண்மையைத் தொடங்கினர். இதே காலகட்டத்தில் அல்லது இதற்கு சிறிது பிற்பட்ட கால எல்லையில் தமிழகத்தின் பிற பகுதிகளிலும் வேளாளர்களால் வேளாண் தொழில் தொடங்கப்பட்டிருத்தல் வேண்டும். இதனை தொல்லியல் ஆய்வுகளும் உறுதி செய்கின்றன.  
 {'\n\n'}
   நீரை அடிப்படையாகக் கொண்ட வெள்ளத்தை அடக்கி வேளாண்மையை தொடங்கிய வேளாளர்கள் தங்களைக் கங்கைகுலத்தவர் என்று சொல்லிக் கொள்வதில் பெருமை கொண்டனர். இவர்களுக்கு கங்கைச் சமவெளியிலிருந்த கண்ணன் எனப்படும் கிருஷ்ணர் உதவிகள் செய்துள்ளார். கங்கைப் பகுதியில் இருந்த மதுராபுரியிலிருந்து துவாரகைக்கு வேளாளர்கள் சென்றமையால் கங்கை மைந்தர் என்றும் துவராபதி வேளார் எனவும் வேளாளர்களுக்குப் பெயர்கள் ஏற்பட்டிருக்கலாம் என சில ஆய்வாளர்கள் குறிப்பிடுகின்றனர்.  நிலத்திற்கு அடிப்படை கால்நடைச் செல்வமும் ஆகும். எனவே யதுகுல வேந்தன் கண்ணனின் தொடர்பு வேளாண் மக்களுக்குப் பெரிதும் உதவியது. </Text>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    backgroundColor: '#fff',
    padding: 16,
    textAlign: 'justify'
  },
  image: {
    width: '100%',
    height: 220,
    borderRadius: 16,
    marginBottom: 16,
  },
  title: {
    fontSize: 22,
    fontWeight: 'bold',
    color: '#047857',
    marginBottom: 12,
    textAlign: 'center',
  },
  content: {
    fontSize: 16,
    color: '#333',
    lineHeight: 26,
    textAlign: 'justify',
    width: 343,
    paddingRight: 6
  },
});
