// app/vellalar/gangai-amman.tsx
import { ScrollView, Text, View, Image, StyleSheet } from 'react-native';
import BackButton from '@/components/BackButton';
export default function MagabaliScreen() {
  return (
    <ScrollView style={styles.container} contentContainerStyle={{ paddingBottom: 40 }}>
<BackButton/>
      <Image
        source={require('@/assets/images/ganga.jpg')}
        style={styles.image}
        resizeMode="cover"
      />

      <Text style={styles.title}>மகாபலி இந்திரனை வெல்லுதல்</Text>

      <Text style={styles.content}>
	புராணங்களில் ஹிரண்யகசிபுவின் மகனான பிரகலாதனின் பேரனாகச் சித்தரிக்கப்படுபவர் மகாபலி, இவர் அசுரர்களுக்குத் தலைமை தாங்கி தேவர்களோடு போர் தொடுத்தவர். தேவர்களின் தலைவன் இந்திரனை தோற்கடித்து அமராவதிப் பட்டினத்தைக் கைப்பற்றி பெரும் யாகம் ஒன்றை செய்தவர் மகாபலி.  அந்த யாகத்தில் வேண்டியவர்களுக்கு வேண்டும் கொடைகள் பல அளித்தார்.  இந்திரனை பதவியில் இருந்து முழுவதுமாக இறக்க மேற்கொண்ட யாகத்தை முறியடிக்க இந்திரனுக்கு திருமால் வாமணாவதாரம் எடுத்து மகாபலியை வெற்றி பெற விழைந்தார். மகாபலி இறுதியில்  தம் திருவடியின் கீழ் இருத்தி பாதாள உலகின் அரசராக்கினார். 
        {'\n\n'}
 	வேளாளர்களின் வழியாக போற்றப்படும் வாணர்களின் மூதாதையான மகாபலிக்கும் இந்திரனுக்கும் பகைமை இருப்பது இதன் மூலம் அறிய முடிகிறது. எனவே தற்காலத்தில் தேவேந்திரன் பெயருடன் வழங்கி வரும் சில சமூகப்பிரிவினர் வேளாளர்கள் எனத் தங்களை முன்னிறுத்திக் கொள்வது பொருந்தா வாதமாகவே உள்ளது. மேலும் வேளாளர்களை ஒன்றிணைத்து தென்னகத்தில் குடியேற்றிய அகத்தியர் இந்திரனை அலைய வைத்து அவனது மகன் சயந்தனைப் பழி வாங்கிய செய்தியைப் புராணங்கள் குறிப்பிடுகின்றன. எனவே வேளாளர்களுக்கும் இந்திரனுக்கும் எவ்வித தொடர்பும் இல்லை என்பது இங்கு ஈண்டு நோக்கத் தக்கது. 
        {'\n\n'}
    இந்திரன் வேளாளர் வழி வந்த சோழ மன்னன் முசுகுந்த மன்னரிடம் யாசகம் பெற்று அரக்கர்களைத் தோற்கடித்தமையை சிலப்பதிகாரம் சுட்டும். கொடும்பாளூர் வேளீர்களின் மூலதெய்வமாக மூவர்கோயிலில் உள்ள இறைவன் முசுகுந்தேஸ்வரர் என்றே வழங்கப்படுகின்றார்.  தஞ்சை புதுக்கோட்டை மாவட்டங்களின் கடற்கரைப் பகுதி அக்காலத்தில் மிழலைக்கூற்றம் எனப்பட்டது. இப்பகுதியை வேளீர் வழி வந்த மாவேள் எவ்வி என்பவர் ஆட்சி செய்கின்றார். இது முசுகுந்த நாடு எனவும் வழங்கப்படுகிறது. புறநானூற்றுப் பாடலில்  மிழலைக்கூற்றம் கடற்கரையை ஒட்டி அமைந்திருந்ததையும்  அதனை வேளீர் மன்னன் எவ்வி ஆட்சி புரிந்ததையும் குறிக்கிறது.
        {'\n\n'}
  <Text style={styles.bold}>
    ”முந்நீருண்டு முந்நீர்ப் பாயும்
தாங்கா வுறையு நல்லூர் கெழீ இய
ஓம்பா வீகை மாவேள் எவ்வி
புனலம் புதவின் மிழலை“</Text>
        {'\n\n'}
    எனக் குறிப்பிடுகிறது. கொடும்பாளூர் வேளீர் மன்னனான இருங்கோவேண்மானை எவ்வி தொல்குடியில் உதித்தவன் எனக் கபிலர் குறிப்பிடுவார். எனவே இன்றைய பட்டுக்கோட்டைப் பகுதியில் வாழும் முசுகுந்த வேளாளர்கள் அவ்வழி வந்தவர் ஆவர். கொடும்பாளூர் வேளீர் குறித்து பின்னர் காண்போம்.
        {'\n\n'}
    எனவே முன்னர் குறிக்கப்பட்ட மகாபலி கொடை வள்ளல். வேளாளர் என்ற பெயரே கொடைகள் அளிப்பதில் சிறந்தவர்கள் என்ற பொருள்பட அழைக்கப்பட்டது. மகாபாரதத்தில் மகாபலி குறித்த ஒரு சுவையான செய்தி உள்ளது.  வேளாளர்கள் கொடைகளில் சிறந்தவர்கள் என்பதை தெரிவிக்கிறது.  மகாபாரதத்தின் தருமர் தனது ஆட்சியில் தருமத்தை நிலைநாட்டி மிகச் சிறந்த மன்னராக விளங்கினார்.  தருமம் அளிப்பதில் தருமராஜனுக்கு நிகரானவர் எவரும் இல்லை என்ற இறுமாப்பு அவருக்கு நாளடைவில் ஏற்பட்டது. இச்செருக்கை நீக்க கண்ணன் ஒரு திட்டம் தீட்டினார். அதன்படி பாதாளத்தில் ஆட்சி செய்த மகாபலியை அறிமுகம் செய்து வைத்து தருமரைக் குறித்து கீழ்கண்டவாறு குறிப்பிட்டார். தருமர் அனைத்து தருமங்களுக்கும் இருப்பிடமானவர். ஒவ்வொரு நாளும் ஆயிரத்திற்கும் மேற்பட்டவர்களுக்கு தருமம் செய்து நல்லாட்சி புரிந்து வருகின்றார்.  இது போன்று ஒரு கொடையாளியை இவ்வுலகில் காண இயலாது என்றார். 
        {'\n\n'}
    	இதனைக் கேட்ட மகாபலி புன்னகை செய்து, உங்கள் நாட்டில் ஒவ்வொரு நாளும் ஆயிரக்கணக்கானவர்கள் உங்களிடம் வந்து பிச்சை எடுத்து உண்ணுமாறு செய்வது தருமம் ஆகாது. அதில் எவ்வித புண்ணியமும் கிட்டாது. இதனால் பெருமை கொள்வதிலும் செருக்கு அடைவதிலும் எவ்வித பலனும் இல்லை என மறுமொழி அளித்தார். இதனை நல்லாட்சி என்று எவ்வாறு கூற முடியும் என்றும் வினவினார். என் நாட்டிற்கு வாருங்கள் அங்கு ஓர் ஊரையே நான் தானமாக அளித்தாலும் வாங்கிக் கொள்ள எவரும் வரமாட்டர். அத்தகு வளத்தை நான் அங்கு கொடையாக அளித்துள்ளேன். எவரும் வறுமை இன்றி மகிழ்ச்சியாக வாழ்கின்றனர் அதுவே தருமம் எனக் கூறினார்.  அத்தகைய நல்லாட்சியை நான் மக்களுக்கு அளிக்கின்றேன் எனக் குறிப்பிட்டார். இதனால் தருமரின் செருக்கு கலைந்தது. அத்தகு வல்லமை வாய்ந்த மகாபலியின் வழியில் வந்த வேளாளர்கள் கொடை வள்ளல்களாகவும் சொன்ன சொல்லைக் காப்பாற்றுவர்களாகவும் தொன்று தொட்டு வாழ்ந்து வந்தனர் என்பது வரலாற்று உண்மை.
        {'\n\n'}
    இதனையே சங்க இலக்கியங்களின் கடை ஏழு வள்ளல்களின் கொடைத் தன்மையை நோக்கும் பொழுது நன்கு விளங்கும். பிற்காலத்தில் உலகமே வியக்கும் வண்ணம்   வேளாளர்களின் மாண்பு குறித்த பழையனூர் வேளாளர் தங்களது நிலத்தில் விளைந்த நெல்லை கோயில்களுக்கும் வறியவர்களுக்கும் அளித்து தங்களது வீடுகளில் வரகினால் கூழ் செய்து அருந்தினர் என்பது வரலாற்றில் குறிக்கப்பட்டுள்ளது. இவர்கள் “கூழாண்டார் கோத்திரம்” எனக் கல்வெட்டுகளில் வழங்கப்பட்டனர். இது குறித்து விரிவாக பின்னர் காண்போம். 
        {'\n\n'}
    இவ்வாணர்களின் வழி வந்தவரே கல்கி எழுதிய பொன்னியின் செல்வனின் கதைத் தலைவன் வந்தியத்தேவன்.   இவர் திருவல்லத்தின் கோமகனாக விளங்கியமையால் இவர் (திரு)வல்லத்தரையர் என வழங்கப்பட்டார்.  வாணாதிராயர்கள் தங்களது ஆதிக்கத்தை இப்பகுதியில் தொடக்க காலத்தில் செலுத்தி பின்னர் படிப்படியாக வேளாளர் குடிப்பெயர்ச்சியின் பொழுது தமிழகத்தின் பிற பகுதிகளுக்கும் சென்று தங்களது ஆளுமையை செலுத்தினர். தமிழகம் முழுவதுமாக இவர்கள் குறுநில அரசுகளாக பிற்காலத்தில் மிளிர்ந்தனர்.  வேளாளர்களின் தொன்மை இடமாக விளங்கி வருகின்ற தொண்டை மண்டலத்தில் வேளாளர் வகுப்பைச் சேர்ந்தவர்களே பெருமளவில் வாழ்கின்றனர். இவர்கள் தொண்டை மண்டல முதலியார் என வழங்கப்படுவர். இவர்களுக்கு பல உட்பிரிவுகள் உள்ளன. துளுவ வேளாளர், வீரகொடி வேளாளர், ஆற்காடு முதலியார், பூந்தமல்லி வேளாளர், சைவ வேளாளர் எனப் பல உட்பிரிவுகள் உண்டு.
        {'\n\n'}
     	இதே போன்று தமிழகத்தின் அனைத்துப் பகுதிகளிலும் வேளாளர்கள் அந்நிலப் பகுதியின் பொதுவான பெயரைக் கொண்டு வாழ்ந்து வருகின்றனர். ஏனேனில் வேளாண்மை முதன்மைத் தொழில். அதனை காத்து வருபவர் வேளாளர். அந்த அந்தப்பகுதியில் வாழும் சில சமூகங்கள் உழுகுடிகளாக   வாழ்ந்து வருகின்றனர். தமிழகத்தின் வடபகுதி மாவட்டங்களில் சில குறிப்பிட்ட சமூகத்தினர் உழுகுடிகளாகவும் தென் தமிழகத்திலும் மேற்குத் தமிழகத்திலும் வேறு சில சமூகத்தினர் உழுகுடிகளாக வாழ்வதும் இன்றளவும் உள்ளது. வேளாளர்கள் மட்டுமே தமிழகத்தின் அனைத்துப் பகுதிகளிலும் வாழ்கின்ற மக்களாக தொன்றுதொட்டு தொன்மைக்குடிகளாக வாழ்ந்து  வருகின்றனர்.
    
       </Text>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    backgroundColor: '#fff',
    padding: 16,
    textAlign: 'justify'
  },
  image: {
    width: '100%',
    height: 220,
    borderRadius: 16,
    marginBottom: 16,
  },
  title: {
    fontSize: 22,
    fontWeight: 'bold',
    color: '#047857',
    marginBottom: 12,
    textAlign: 'center',
  },
  content: {
    fontSize: 16,
    color: '#333',
    lineHeight: 26,
    textAlign: 'justify',
    width: 343,
    paddingRight: 6
  },
  bold: {
    fontWeight: '800',
    fontSize: 15,
    fontStyle: 'italic'
  }
});
