// app/vellalar/migration.tsx
import BackButton from '@/components/BackButton';
import { ScrollView, Text, View, Image, StyleSheet } from 'react-native';

export default function MigrationScreen() {
  return (
    <ScrollView style={styles.container} contentContainerStyle={{ paddingBottom: 40 }}>
     <BackButton/>
      <Image
        source={require('@/assets/images/farm2.jpg')}
        style={styles.image}
        resizeMode="cover"
      />

      <Text style={styles.title}> வேளாளர் பரவல் -விரிவாக்கம் புலம் பெயர்தல்</Text>

      <Text style={styles.content}>
தொண்டை மண்டல சதகமும் சோழ மண்டல சதகமும், கொங்கு மண்டல சதகமும் தொண்டை மண்டல வேளாளர் நற்குடி 48000 குடிகள் சோழ மண்டலத்திற்கும் கொங்கு மண்டலத்திற்கும் சென்று குடியேறி வேளாண்மையை அப்பகுதிகளில் சிறப்புறச் செய்தாகக் குறிப்பிடுகிறது.   தொண்டை மண்டலத்தின் வேளாளர் மாண்பை தொன்று தொட்டு பேசப்படும் பழையனூர் வேளாளர் நீலி கதையின் மூலம் விரிவாக அறியலாம்.          
{'\n'}{'\n'}
வேளாளர் நாடு      
{'\n'}{'\n'}
சங்க காலத்தில் பண்டைத்தமிழகத்தின் மேற்கில் இருந்த கொண்கானம் மற்றும் துளு பகுதிகள் நன்னன் என்ற வேளாளர் வழி வந்த மன்னர்கள் ஆட்சி புரிந்து வந்தனர். இவர்களைக் குறித்து சங்க இலக்கியங்கள் குறிப்பிடுகின்றன. இப்பகுதியைக் கோசர்கள் படையெடுத்ததால் நன்னன் வழிவந்தோர் அப்பகுதியை விட்டு தமிழகத்தின் தொண்டைமண்டலப் பகுதிக்கு குறிப்பாக திருவண்ணாமலை, செங்கம், திருப்பத்தூர், வாணியம்பாடி வட்டங்கள் அடங்கிய நவிர (இன்றைய ஜவ்வாது) மலைப்பகுதியில் குடிபெயர்ந்தனர்.  இவர்களது தலைநகரமாக செங்கம் விளங்கியது. அக்காலத்தில் இது செங்கண்மா(செங்கம்) என வழங்கப்பட்டது. சங்க இலக்கியங்களில் பத்துப்பாட்டு நூல்களில் ஒன்றான மலைபடுகடாம் நூலின் பாட்டுடைத்தலைவன்  செங்கண்மா அந்துவேள்  நன்னன் என்பவர் இப்பகுதியின் மன்னனாவார். இவர் வேளாளர் வழி வந்தவர்.  இம்மன்னன் இப்பகுதியை சீரும் சிறப்புமாக ஆட்சி செய்தார்.  இதனை செங்கம் ரிஷபேஸ்வரர் கோயிலில் உள்ள சோழர்கால பாடல் கல்வெட்டு ஒன்றின் மூலமும் அறியமுடிகிறது. இக்கல்வெட்டுப் பாடல் பின்வருமாறு.
{'\n'}{'\n'}
        “மூவண்டறை தார்மன்னர் மலைமிடைத் தென் மன்னரை
வெண்கண்ட திறாற் காங்கேமன் கண்சிவப்ப பண்டே
மலைகடாம் பாட்டுண்ட மால்வரை செஞ்சோரி 
அலைகடாம் பாட்டுண்டே “
.
{'\n'}{'\n'}
இவன் வழி வந்த மன்னன் அதிரன் எதிரன் சேந்தன் என்ற பிறிதொரு மன்னரும் சிறப்பான ஆட்சி செய்து வருகின்றார். செங்கம் அருகிலுள்ள ஆண்டிப்பட்டி என்னும் ஊரில் இவர் வெளியிட்ட தமிழி எழுத்துப் பொறித்த ஈயக்காசுகள் கண்டு பிடிக்கப்பட்டன.  இவற்றின் மூலம் சங்க காலத்தில் இப்பகுதி வேளாளர்கள் வாழ்ந்த பகுதியாகவும் அவர் வழி வந்த அரசர்கள் இப்பகுதியை ஆட்சி புரிந்தமையையும் அறிய முடிகிறது. இப்பகுதியே பல்குன்றக்கோட்டம் எனக் கல்வெட்டுகளில் வழங்கப்படுகின்றது. திருப்பத்தூர், திருவண்ணாமலை, போளூர் வாணியம்பாடி பகுதிகளில் பரவி இருக்கின்ற ஜவ்வாது மலைத்தொடரில் உள்ள ஊர்கள் வேளாளர்களுடன் பெரிதும் இணைத்துப் பேசப்படுகிறது. 
     
{'\n'}{'\n'}
     இப்பகுதியில் பல பகுதிகள் வேளாளர் நாடு என வழங்கப்பட்டன. ஜவ்வாது மலைப்பகுதி இன்றளவும் வேளாளர் நாடு என்றே வழங்கப்படுகிறது. மேலும் பாலாற்றங்கரையில் அமைந்துள்ள வாணியம்பாடி உதயேந்திரம் பகுதி வேளாள சிகரம் என்ப்பட்டது. இதன் தமிழ் வடிவம் வேளாளமுடியாகும். உதயேந்திரம் செப்பேடுகளும் கந்த சிஸ்யனின் ராயக்கோட்டை செப்பேடுகளும் வேளாள சிகரத்தைப் பற்றித் தெரிவிக்கின்றன. மேலும் கிருஷ்ணகிரிக்கு கிழக்கு வடக்குப் பகுதிகளான இராயக்கோட்டை திருப்பத்தூர் வாணியம்பாடிக்கு வடக்கு ஆகிய பகுதிகள் கங்க நாட்டின் பகுதியாக சோழர் காலத்திலும் தொடர்ந்து வேளாளர் நாடு என்னும் பிரிவுடன் இருந்ததைக் கல்வெட்டுகள் மூலம் பேராசிரியர் சுப்பராயலு சோழர் கால நிலப்படம் மூலம் காட்டியுள்ளார். எனவே வேளாளர்களின் ஆதிக்கம் தொடக்க காலத்தில் சங்க காலத்திலும் பல்லவர் காலத்திலும் சோழர் காலத்திலும் தொண்டை மண்டலத்தில் செல்வாக்குப் பெற்றிருந்தமையை அறிய முடிகிறது.
     {'\n'}{'\n'}
     முதலியார் அல்லது கவுண்டர் பட்டங்கள் உடைய வேளாளர் பெருமளவில் இன்றளவும் வேளாண் மக்களாக வட ஆற்காட்டின் திருப்பத்தூர் பகுதியில் வாழ்ந்து வருகின்றனர்.  இப்பகுதியில் வேளாளர்களில்  பல குடும்பங்களுக்கு குறிப்பாக அம்பலூர் வாணியம்பாடி,  திருப்பத்தூர் பகுதியில் கவுண்டர் பட்டமும்  காணப்படுகின்றது. எனவே தொண்டைமண்டலத்தில் துளுவ வேளாளர், வேளாள கவுண்டர், சைவ வேளாளர் (வெள்ளாய் முதலியார்)   ஆற்காடு முதலியார், பூந்தமல்லி முதலியார்  தொண்டை மண்டல முதலியார் ஆகிய அனைத்துப் பிரிவுகளும் ஒரு குடியின் கீழ் வருகின்ற வேளாளர்களே. வேளாளர்கள் நிலங்களில் அவ்வவ் பகுதிகளில் இருந்த சில குடிகளைத் தங்கள் நிலங்களில் பணியாற்றும் குடிகளாக அமர்த்திக் கொண்டனர். அவ்வகையில் தொண்டை மண்டலத்தில் இருந்த  சில குடிகள் உழுகுடி பணியைச் செய்தனர்
     {'\n'}{'\n'}
     பக்தி இயக்க காலத்தில் தொண்டை மண்டல வேளாளர்கள் பலர் சைவத்தைப் பெரிதும் போற்றியமையாலும் புலால் உண்பதை மறுத்தமையாலும் சைவ வேளாளர் எனவும் வழங்கப்பட்டனர்.  இவர்களுள் சிலர் பல்லவர் காலத்தில்  சமண சமயத்தையும் தழுவத் தொடங்கினர். இன்றளவும் காஞ்சிபுரம் சுற்றியுள்ள செய்யார், வந்தவாசி, ஆற்காடு, செஞ்சி பகுதிகளில் பெருமளவில் சமணத்தைச் சார்ந்த நைனார் என்னும் மரபினர் வாழ்ந்து வருகின்றனர்.. இவர்கள் இன்றும் சைவ வேளாளர்  (நயினார்-சமணர்) என்றே அழைக்கின்றனர். இவர்கள் வேளாளர்களே என்பதற்கு  திருவண்ணாமலை அப்பர் மடத்தின் செப்புப்பட்டயம் வழி அறிய முடிகிறது.;
     {'\n'}{'\n'}
     இப்பகுதி மேற்குறித்தது போல் வேணாடு (வேளாளர் நாடு) எனக் கல்வெட்டுகளில்  வழங்கப்படுகிறது. மேலும் சிறிய நாட்டுப் பிரிவுகளாக ஆந்தைப்பாடி நாடு, ஈஞ்சைப்பாடி நாடு, கூறை நாடு போன்ற பிரிவுகளையும் பெற்றுத்திகழ்கிறது.  இப்பகுதிகளில் இருந்து தமிழகத்தின்  தெற்கிலும் மேற்கிலும்  சென்ற வேளாளர்கள் தாங்கள் இருந்து வந்த பகுதிகளின் பெயரையோ அல்லது அவர்களை வழி நடத்திச் சென்ற தலைவர்களின் பெயர்களிலோ தங்களின் (குடி அல்லது குலம்) கூட்டப் பெயர்களாக பின்னர் வைத்துக்கொண்டனர். 
     {'\n'}{'\n'}
     குறிப்பாக கொங்குப் பகுதியில் குடியேறிய வேளாளர்களின் கூட்டப் பெயர்கள் பெரும்பாலும் இப்பகுதியின் நாட்டுப் பெயர்களிலோ அல்லது குடிப்பெயர்களாக வைத்துக்கொண்டனர். கொங்குப் பகுதியின் பழைய கோட்டைப் பட்டாக்காரர் வேணாடுடையார் என்றே வழங்கப்படுகின்றனர். இவர்களின் பூர்வீகம் வேலூர் அருகிலுள்ள திருவல்லமாகும். வாணர்கள் அல்லது பெரும்பாணர் ஆட்சி செய்த பகுதி பெரும்பாணப்பாடி என வழங்கப்பட்டது. இது இன்றைய சித்தூர், புங்கனூர், வேலூர் பாலாற்றின் கரையிலுள்ள வாணியம்பாடி ஆகிய பகுதியாகும்.
     {'\n'}{'\n'}
     வாணகோப்பாடி என்னும் பகுதி திருக்கோயிலூர், திருவண்ணாமலை பழைய வட ஆற்காடு மாவட்டத்தின் தென்மேற்குப் பகுதியாகும். இப்பகுதியை சங்க காலத்திலிருந்து சீரும் சிறப்புமாக வாணாதிராயர்கள் ஆட்சி புரிந்தனர்.பல்லவர்,சோழர்,பாண்டியர், விஜயநகர ஆட்சிகளின் பொழுது இவர்கள் குறுநில மன்னர்களாக விளங்கினர் சில நேரங்களில் தனித்தும் செயல்பட்டனர். இவர்களின் கொடி வருடை ஆகும். தகர் வருடையை இன்றும் சமத்தூர் வாணராயர்கள் தங்களின் சின்னமாகக் கொண்டிருக்கின்றனர். தங்கள் நாடான பெரும்பாணப்பாடி நாட்டிலிருந்த ஸ்ரீபர்வத மலைப் (திருப்பதி) பெருமாளை பாணர்கள் வழிபட்டனர். இன்றளவும் திருப்பதி பெருமாளை தங்களின் முக்கிய தெய்வமாக சமத்தூர் வாணராயர்கள் வழிபட்டு வருகின்றனர்.
     {'\n'}{'\n'}
     கொங்கு வேளாளர்களில் ஆந்தைக்கூட்டம், ஈஞ்ச கூட்டம், கூறை கூட்டம் என்ற கூட்டங்களின் பெயர்கள் இன்றளவும் இருக்கின்றன. இவர்கள் இப்பகுதியிலிருந்து கொங்குப் பகுதிக்கு   48000 குடிகள் சென்ற பொழுது குடியேறிய வேளாண் மரபினர்.  தொண்டை மண்டல வேளாளர்கள் திருமணங்களில் கூறைப்புடவைக் கட்டும் வழக்கம் இன்றளவும் இருந்து வருகின்றது. அதே போன்று கொங்கு வேளாளர்களில் கூறை கூட்டம் என்ற கூட்டம் உள்ளதும் இங்கு குறிப்பிடத்தக்கது.
     
      </Text>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    backgroundColor: '#fff',
    padding: 16,
    textAlign: 'justify'
  },
  image: {
    width: '100%',
    height: 220,
    borderRadius: 16,
    marginBottom: 16,
  },
  title: {
    fontSize: 22,
    fontWeight: 'bold',
    color: '#047857',
    marginBottom: 12,
    textAlign: 'center',
  },
  content: {
    fontSize: 16,
    color: '#333',
    lineHeight: 26,
    textAlign: 'justify',
    width: 343,
    paddingRight: 6
  },
});
