import { ScrollView, Text, View, Image, StyleSheet } from 'react-native';

export default function OriginStoryScreen() {
  return (
<ScrollView style={styles.container} contentContainerStyle={{ paddingBottom: 40 }}>
      <Image
        source={require('@/assets/images/farm.webp')}
        style={styles.image}
        resizeMode="cover"
      />

      <Text style={styles.title}>வேளாளர் தோற்ற வரலாறு</Text>

      <Text style={styles.content}>
        தொல்பழங்காலத்தில், குறிப்பாக புதிய கற்காலத்தில், மனித இனம் நாடோடியாக இருந்து நிலையான வாழ்க்கையைத் தேடிக் கொண்டிருந்தது. 
        அப்பொழுது, ஆற்றங்கரைப் பகுதிகளிலும் மலைச்சரிவுகளிலும் வாழ்ந்த மக்கள் சிறு அளவில் வேளாண்மையைத் தொடங்கினர். 
        இதற்காக கல்லால் செய்யப்பட்ட கூர்மையான கருவிகளைப் பயன்படுத்தினர். புதிய கற்கால மனிதன் உணவைத் தேடி திரியும் நிலையிலிருந்து 
        உணவை உற்பத்தி செய்யும் நிலையில் மாறினான்.
        {'\n\n'}
        இக்காலத்தில் மனிதன் கைகளால் மட்கலன்கள் உருவாக்கி பயன்படுத்தினான். இந்த மாற்றத்தால் தொடங்கியது வேளாண்மை. எனவே வேளாளர் 
        சமூகத்தின் தோற்றம் புதிய கற்காலத்தில் துவங்கியது எனலாம்.
        {'\n\n'}
        தொடக்கத்தில், எல்லா வேளாளர்களும் ஒரே குடியில் பிறந்து, ஒரே சமூகமாக வாழ்ந்தனர். ஆனால், வேளாண் நிலங்கள் விரிவாக பரவியதின் 
        காரணமாக, அந்த ஒரே குடியில் இருந்து பல கிளைகள் உருவாகின. அதனால் வேளாளர் சமூகங்கள் தமிழகம் முழுவதும் பரவி வளர்ச்சியடைந்தன.
        {'\n\n'}
        “Food gatherer became food producer” என்பது இந்த சமூக மாற்றத்தைப் பற்றிய ஒரு சுருக்கமான மேற்கோள்.
        {'\n\n'}
        மன்னர்கள் வேளாண்மை விரிவாக்கத்தை ஊக்குவிக்க வேளாளர்களை தமிழகம் முழுவதும் பரப்பினர். காடு திருத்தி நாடாக்கும் முயற்சியில், 
        வேளாளர் சமூகங்கள் முக்கிய பங்கு வகித்தன.
        {'\n\n'}
        புராணங்களிலும் இலக்கியச் சான்றுகளிலும், வேளாளர்கள் உழைக்கும் மக்களாக, ஈகை உள்ளத்துடன் வாழ்ந்தவர்களாக, மற்றும் 
        சமூக மேம்பாட்டில் பங்கு பெற்றவர்களாக வர்ணிக்கப்படுகின்றனர்.
        {'\n\n'}
        திருவள்ளுவரின் வரிகள் இதை ஒப்புகின்றன:
        {'\n\n'}
        “சுழன்றும் ஏர்ப்பின்னது உலகம் அதனால்{'\n'}
        உழந்தும் உழவே தலை.”
        {'\n\n'}
        “உழுதுண்டு வாழ்வாரே வாழ்வார் மற்றெல்லாம்{'\n'}
        தொழுதுண்டு பின்செல்பவர்.”
        {'\n\n'}
        இந்த வரிகள், வேளாளர் சமூகத்தின் வாழ்க்கை முறை, பெருமை மற்றும் உலகிற்கு செய்த பங்களிப்பை மிக அழகாகக் குறிப்பிடுகின்றன.
      </Text>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    backgroundColor: '#fff',
    padding: 16,
    paddingBottom: 40

  },
  image: {
    width: '100%',
    height: 220,
    borderRadius: 16,
    marginBottom: 16,
  },
  title: {
    fontSize: 22,
    fontWeight: 'bold',
    color: '#047857',
    marginBottom: 12,
    textAlign: 'center',
  },
  content: {
    fontSize: 16,
    color: '#333',
    lineHeight: 26,
  },
});
