// app/vellalar/religion.tsx
import { ScrollView, Text, View, Image, StyleSheet } from 'react-native';
import BackButton from '@/components/BackButton';

export default function VellalarNameScreen() {
  return (
<ScrollView style={styles.container} contentContainerStyle={{ paddingBottom: 40 }}>   
  <BackButton/>  
   <Image
        source={require('@/assets/images/religion.jpg')}
        style={styles.image}
        resizeMode="cover"
      />

      <Text style={styles.title}>வேளாளர் பெயர்க்காரணம்</Text>

      <Text style={styles.content}>
காலத்தால் முற்பட்ட தொல்காப்பியம் என்னும் தமிழ் இலக்கண நூல் தமிழகத்தில் வாழ்ந்த முதன்மையான நான்கு குடிகளைப் பற்றிக் குறிப்பிடுகின்றார். அரசர், அந்தணர், வணிகர், வேளாளர் என குறிப்பிடுகின்றார்.  மேலும் இப்பிரிவு ஆரிய வர்ணாசிரமித்திற்கு முற்றிலும் மாறுபட்டது.  தமிழகத்தில் ஆரியத்தின் தாக்கம் பல்லவர் ஆட்சியின் பொழுதே சிறிது சிறிதாக வளரத் தொடங்கியது. எனவே நான்கு வர்ண அடிப்படையில் சாதிகள் தமிழகத்தில் பிரிக்கப்படவில்லை. அவரவர் செய்யும் தொழிலுக்கேற்ப தமிழ்ச் சமூகம் ஏற்பட்டது. வேளாண் தொழிலுக்கு உதவி புரிகின்ற பதினெட்டு வகையான சமூகப் பிரிவையும் தொல்காப்பியர் சுட்டுகின்றார். அத்துடன் வணிகச் சமூகத்தையும் அவர் வேளாண் சமூகமென்றே குறிப்பிடுகின்றார்.       
 {'\n\n'}
        சங்க இலக்க்கியங்களில் வேளாண்மை மக்கள் பலவாறாக குறிக்கப்படுகின்றனர். அகவர், உழவர், உழவன், ஏராளர், ஏரின்வாழ்நர், ஏரோர், தொழுவர், களமர்  எனப்பட்டனர். உழவுப்பணி புரிவோர் அரிஞர், அரிநர், அரிவணர், அரிவார், கடைசியர்,கிழார் எனவும் அழைக்கப்பட்டனர். உழவுக் கருவிகளாக ஏர், உழுபடை நாஞ்சில், கலப்பை,கொழு, நுகம் என பலவாறாக அழைக்கப்பட்டது. உழவுக்கருவி ஏர், மேழி எனக் கல்வெட்டுகளில் குறிக்கப்பட்டு அழகிய மேழி என்ற பெயரில் சித்திர மேழி என  வேளாளர் சமூக அமைப்பு ஒன்று பெரிய நாட்டார் என்னும் பெயரில் மேழிக்கொடியுடன் உதயமானது.
        {'\n\n'}
        தமிழகத்தின் தென்பகுதியில் ஏர் கருவியின் பெயரால் நாஞ்சில் நாடு உருவானது. நாஞ்சில் நாட்டு வேளாளர் அப்பகுதியில் சீரும் சிறப்பும் பெற்று வாழும் வேளாள மரபினர் ஆவர். அதேபோன்று தொழுவர் என்னும் வேளாளர் தொண்டை மண்டலத்தில் மருவிய துளுவ வேளாளர் ஆயினர். நில உரிமை முழுதும் பெற்ற வேளாளர்கள் ’கிழார்’ என வழங்கப்பட்டனர்.கல்வெட்டுகளில் ஊரின் பெயரில் அமைந்த கிழார்கள் பற்றியும் அறியமுடிகிறது. நிலக்கிழார் என்று இன்றைய வேளாளப் பெருமக்களே அழைக்கப்படுகின்றனர். இலங்கையில் ஆனைக்கோட்டையில் இரும்புக்காலத்தைச் சார்ந்த ஈமக்கிட்டங்கியில் உலோக முத்திரையில் கோவேத(ன்) என்ற பெயர் பொறிப்பு முத்திரை ஒன்றை தொல்லியல் ஆய்வாளர்கள் கண்டுபிடித்தனர். இதில் குறியீடுகள் முதல் வரியிலும் இரண்டாவது வரியில் தமிழி எழுத்துகளும் உள்ளன. இதில் கோ என்பது குறுநில மன்னன்  அதாவது கிழான் என்னும் பொருளில் அமைந்தது என  இலங்கை வரலாற்றுப் போராசிரியர் பத்மநாதன் தெரிவிக்கின்றார்.
        {'\n\n'}
        சேலம் மாவட்டத்தில் மேட்டூருக்கு அருகிலுள்ள அம்மன் கோயில் பட்டி என்ற இடத்தில் உள்ள பொ.ஆ. 3- 4 ஆம் நூற்றாண்டைச் சார்ந்த கல்வெட்டு ஒன்றில் பரம்பன் கோகூர் கிழான் என்பவர் தண்ணீர் குளம் வெட்டியமையைக் குறிக்கின்றது. சங்க இலக்கியங்களில் பல புலவர்கள் கிழார் பட்டம் பெற்றவர்கள். பழையனூர் வேளாளர்களில் புரிசைக் கிழார் குறிக்கப்படுகின்றார். பல்லவர் சோழர் கல்வெட்டுகளில் கிழார்கள் வேளாளர்களாகவே குறிக்கப்படுகின்றனர். சைவசமயத்தைப் பெரிதும் போற்றிய சேக்கிழார் வேளாளர் மரபில் வந்தவர். சென்னைக்கு அருகில் குன்றத்தூரில் இவர் பிறந்தவராவார்.
        {'\n\n'}
        இரண்டாயிரம் ஆண்டுகளுக்கு முன்பே நிலங்களில் பணி செய்யும் மக்கள் இருந்துள்ளதை சங்க இலக்கியங்கள் குறிப்பிடுவதாக ஆய்வாளர் சாமி சிதம்பரனார் குறிப்பிடுவார். இவர்கள் உழுது உண்ணும் மக்களாவர். (Agricultural Labourers) இவர்களது நாகரிகமும் ஒழுக்கமும் வேளாளர்களிலிருந்து மாறுபட்டு இருந்தமையையும் சாமி சிதம்பரனார் குறித்துள்ளார். பெரும்பாணாற்றுப்படையில் வயல்களில் பணியாற்றும் குடிகளுக்கான பண்பாட்டு வேற்றுமைகளை இவர் சுட்டுகின்றார்.
        {'\n\n'}
      <Text style={styles.bold}>
        ”இரும்பு வடித்தன்ன மடியா மென்றோற்
கருங்கை வினைஞர் காதலஞ் சிறா அர்
பழஞ்சோற் றமலை முனைஇ வரம்பிற்
புதுவை வேய்ந்த கவிகுடின் முன்றி
லவலெறி யுலக்கைப் பாடு விறந்தயல
கொடுவாய்க் கிள்ளை படுபகை வெருஉ
நீங்கா யாணர் வாங்குகதிர்க் கழனி“ {'\n'} (பெ.படை 222-228)
      </Text>
        {'\n\n'}
        நிலங்களில் பணியாற்றும் பணி செய்க்குடிகள் வலிமையான கைகளை உடையவர்களாகவும் தங்களது குழந்தைகள் பழஞ்சோற்றை வெறுத்து நீங்க வயல்களில் அறுவடைக்குப்பின் எடுக்கப்பட்ட வைக்கோல் கொண்டு வேயப்பட்ட குடிசை வீடுகளை வயல் வரப்புகளில் அமைத்து வாழ்ந்தனர் என்றும் குடிசைகளின் முற்றத்தில் அவல் உணவை இடித்து உண்ணும் வழக்கம் உடையவர் என்றும் குறிப்பிடுகின்றார். அவல் இடிக்கும் ஒலி கேட்டு கிளிகள் பறந்து செல்லும்.  நிலங்களின் வரப்புகளில் இவர்களுக்கு சிறிய குடிசைகள் இருந்தன.  கழனிகளில் பணியாற்றுவதால் உடல் வலிமை உள்ளவர்களாக இவர்கள் விளங்கினர். இவர்கள் வினைஞர் எனப்பட்டனர்.
        {'\n\n'}
        பிற்காலக் கல்வெட்டுகளில் இப்பணிமக்கள் குடி நீங்கா என்றும் குடி நீங்கி என்ற வகையில் பணியில் இருந்தனர்.  இதேபோன்று முல்லை நிலப் பகுதியிலும் உழுது உண்ணும் பணிமக்கள் குடியிருப்புகள் இருந்தன. யானையின் காலை ஒத்த வரகுத் திரிகையால் பந்தல் நட்டு வைக்கோலால் போர்த்தப்பட்ட குடிசைகளில் வாழ்ந்தனர். இவர்கள் அமைத்த பந்தல் பகுதியில் இடிந்த சுவர்களில் கலப்பைகள் சார்த்தி வைக்கப்பட்டிருந்தன. குடிசையின் கொட்டில்கள் புகை சூழ்ந்த நிலையில் இருந்தன. இவர்கள் வாழ்ந்த பகுதி சீறூர் என வழங்கப்பட்டது. வரகையும் அவரைப்பயறையும் சேர்த்த பருப்புச்சோற்றை இவர்கள் உண்டனர். 
        {'\n\n'}
        	இதற்கு மாறாக வேளாளர்கள் செல்வச் செழிப்புடன் அக்காலத்தில் வாழ்ந்து வந்துள்ளமையையும் சங்க இலக்கியங்கள் சுட்டுகின்றன. மருத நிலப்பகுதியில் உள்ள ஊர்களில் இவர்கள் வாழந்தனர். வேளாளர்களான உழுவித்துண்போரின் இல்லத்தில் வாழும் குழந்தைகள் வளம் பெற்றவர்களாகவும் தங்களது வீடுகளில் நீண்ட ஏணிகள் வைத்தும் எட்டாத உயரத்தில் இருந்த கூதிர்களில் (நெற்கூடு கிட்டங்கிகளில்) இருக்கும் பழைய நெல்லை எடுத்து சமைத்து உண்டனர் என்றும் அக்குழந்தைகள் விளையாடி களைத்துத் தங்களது இல்லங்களை அடைந்த பொழுது செவிலித்தாய்கள் பால் ஊட்டி படுக்கையில் உறங்க வைத்தனர். அவ்வீடுகள் மிக அழகான வீடுகளாக இருந்தன என்றும் பெரும்பாணாற்றுப்படைக் குறிப்பிடுகின்றது.
        {'\n\n'}
        மருத நிலம் பகுதியில் வாழ்ந்த வேளாண் மக்கள் மற்ற நிலத்தில் வாழ்ந்த மக்களை விட செழிப்புடன் வாழ்ந்தனர். தமிழகத் திணை அமைப்பில் முதலில் இனக்குழு அழிந்து அரசுருவாக்கம் இப்பகுதியில் தான் ஏற்பட்டது. இதன் தொடர்ச்சியே வேளீர் வேந்தர். பிற இன  மக்களையும் அரசில் இணைக்கப் பல போர்கள் இக்காலத்தில்  நடைபெற்றன என்பதை இலக்கியங்கள் வழியாக அறியலாம். 
        {'\n\n'}
        தமிழக வேளாளர்கள் வரலாறு நீண்டதொரு வரலாறாகும். தற்காலத்தில் தமிழகத்தின் அனைத்து மாவட்டங்களிலும் வாழ்ந்து வரும் வேளாளர்கள் அப்பகுதியின் பெயருக்கு ஏற்பவோ அவர்களின் பண்பாட்டுக் கூறுகளின் அடிப்படையிலும் பல்வேறு பிரிவுகளாக செயல்பட்டு வருகின்றனர். இவர்கள் ஒரு குடியில் வந்துள்ளனர் எனினும் தற்காலத்தில் அவ்வவ் பகுதிகளில் நிலவுகின்ற பண்பாட்டு சூழல்களுக்கு ஏற்ப தங்களது வாழ்க்கை நடைமுறைகளில் சில மாற்றங்களைக் கொண்டுள்ளனர் எனினும் தொன்றுதொட்டு வேளாளர்களுக்கே உரிய பொதுவான பண்பாட்டுக் கூறுகளையும் தங்களது தொன்மங்களையும் தன்னகத்தே தொடர்ந்து கொண்டுள்ளவர்களாகவே வாழ்ந்து வருகின்றனர்.  தமிழகத்தில் இன்று உள்ள தமிழ்ச் சமூகங்கள் 209 அகமணச் சமூகங்களில் வேளாளர்கள் மட்டுமே 40 க்கும் மேற்பட்ட உட்பிரிவுகளைக் கொண்டு விளங்குகின்றனர். வேளாளர் இனம் மட்டுமே தமிழகம் முழுவதும் பல்வேறு கிளைகளாக வாழ்ந்துவருகின்றனர். 
        {'\n\n'}
        வேளாளர் என்னும் சொல் ஈகையுடையார் என்னும் பொதுவான கூறாக அவர்களுக்கு விளங்கியது என்பார் மறைமலை அடிகளார். வேளாண்மை உபகாரம் ஈகையும் விளிம்பும் என்பது பழைய திவாகரச் சூத்திரம். பத்துப்பாட்டு நூல்களில் ஒன்றான பொருநாராற்றுப்படையில் சோழ மன்னன் கரிகாலனிடம் பரிசில் பெற வந்த பொருநன் தனக்குக் கிடைத்த அன்பான விருந்தோம்பலைக் கண்டு
        {'\n\n'}
      <Text style={styles.bold}>
        ”கேளிர் போலக் கேள் கொளல் வேண்டி
வேளாண் வாயில் வேட்பக் கூறி”{'\n\n'}
      </Text>
  என்று குறிப்பிடுகின்றான். வேளாளர்கள் ஈகை உள்ளம் படைத்தவர்கள்.  தங்களது உழைப்பின் காரணமாக விளைந்த உபரி விளைச்சலை பிறருக்கு வழங்கியும் விருந்தோம்பல் செய்தும் மகிழ்வர். இத்தகைய விருந்தோம்பல் செயலை கரிகாலனிடமும் தான் கண்டதாக பொருநன் குறிப்பிடுவதை பேராசிரியர் ம. திருமலை விளக்கமாகக் குறிப்பிடுவார்
        {'\n\n'}
          	இன்றளவும் ஐந்து பண்புகளையும் பெற்றவாறு வாழ்ந்து வருபவர்கள் வேளாளர்கள். வேளாண்மையை முதன்மைத் தொழிலாக கொண்டு விளங்கியவர்களே வேளாளர் எனப்பட்டனர். இந்த பண்புகளைப் பெற்றமையால் இவர்கள் ஒரே ஒற்றைச் சொல்லில் துளு என்னும் முன் ஒட்டுப் பெயரையும் பெற்றனர் என்பதை முன்னர் கண்டோம்.  வெள்ளாமை என்னும் சொல்லிலிருந்தும் வேளாண்மை பிறந்ததாக ஆய்வாளர்கள் கருதுவர். 
        {'\n\n'}
        அதாவது வேளாண்மைக்கு தேவையான நீரான வெள்ளத்தை சேமித்து அதன் மூலம் வேளாண்மைக்கு வித்திட்டவர்கள் வேளாளர்கள். தமிழகத்தில் பெருங்கற்கால மக்களின் ஈமப்பகுதிகளில் ஏரிகள் பல காணப்படுவதையும் அவை அக்காலகட்டத்தில் வாழ்ந்த வேளாண் தொழில் மிக்க தமிழர்களால் அமைக்கப்பட்டன என்பதையும் முன்னரே கண்டோம். தமிழகத்தில் தொண்டைமண்டலத்திலும் புதுக்கோட்டை மாவட்டங்களிலும் ஏரிகள் பல உள்ளன. இதே போன்று ஆற்றுப்பாசனமும் சோழ மண்டலத்தில் உள்ளன. அதனை தக்கவாறு வேளாண்மைக்குப் பயன்படுத்தியவர்கள் வேளாளர்.   தொடக்க காலத்தில் வேட்டையாடி வாழ்ந்த சமூகத்திற்கு நிலத்தைப் பண்படுத்தி உணவு வழங்கிய உயரிய வாழ்க்கையை வாழ்ந்தவர்கள் வேளாளர்கள் எனவே தான் தெய்வப் புலவர் திருவள்ளுவர் 
        {'\n\n'}
      <Text style={styles.bold}>
        ” சுழன்றும் ஏர்ப்பின்னது உலகம் அதனால் 
   உழந்தும் உழவே தலை” என உழவுத்தொழிலே உலகத்தில் முதன்மையானது எனக் கூறிப் போந்தார். மேலும்{'\n'}
” உழுதுண்டு வாழ்வாரே வாழ்வார் மற்றெல்லாந் 
தொழுதுண்டு பின்செல்பவர்”
      </Text>
        {'\n\n'}
        என உழவர்களின் பெருமையைச் சிறப்பாக குறிப்பிடுவார். தேர் இயங்க அதன் அச்சாணி எவ்வளவு முக்கியமோ அது போன்று இந்த உலகம் இயங்க வேண்டுமெனில் அதற்கு அச்சாணியாக விளங்குபவர்கள் வேளாளர்கள் எனவும் உழவுத்தொழிலைச் சிறப்பித்துக் கூறுகின்றார்.  வேளாளர்களின் மாண்பை பட்டினப்பாலையின் ஆசிரியர் உருத்திரங்கண்ணனார் மிகச் சிறப்பாக குறிப்பிடுவார். மேழியை உடைய வேளாளர்கள் பிற்காலத்தில் ஒரு சமூக அமைப்பாக உருவாகி தங்களை சித்திரமேழிப் பெரியநாட்டார் என அழைத்துக் கொண்டமைக்கு பட்டினப்பாலை அடித்தளம் இடுகிறது. 
        {'\n\n'}
      <Text style={styles.bold}>
        ”கொலை கடிந்துங் களவு நீக்கியும்
அமரர்ப் பேணியும் ஆவுதி யருத்தியும்
நல்லானொடு பகடு ஓம்பியும்
நான்மறையோர் புகழ் பரப்பியும்
பண்ணியம் அட்டியும் பசும்பதங் கொடுத்தும்
பண்ணியம் முட்டாத் தண்நிழல் வாழ்க்கைக்
கொடுமேழி நசை உழவர்
நெடுநுகத்துப் பகல் போல
நடுவுகின்ற நன்னெஞ்சினோர்
வடு அஞ்சி வாய்மொழிந்து
தமவும் பிறவும் ஒப்பநாடிக்
கொள்வதூஉம் மிகை கொளாது
கொடுப்பதூஉங் குறை கொடாது
பல்பண்டம் பகர்ந்துவீசுந்”
</Text>
{'\n\n'}
தொல்கொண்டித் துவன்று இருக்கை”என அழகு பட குறிப்பிடுகின்றார்.  கலப்பைத் தொழிலை புரியும் வேளாளர் எவ்வித தீங்கும் இழைக்காத நல் மரபினர். விருந்தினர்களுக்குப் பல பண்டங்களைக் கொடுத்து உதவுபவர். அந்தணர்களை பேணுபவர். நடுவு நிலைப் பிறழாமல் பழிக்கு அஞ்சும் (பழிக்கு அஞ்சிய வேளாளர் குறித்து விரிவாகப் பின் பகுதியில் பார்க்க) பண்பினர்.  
{'\n\n'}
காவேரிப்பூம்பட்டினத்து வேளாளர் தாங்கள் விளைவித்த பொருள்களை நேரிடையாகவேவிற்றனர். குறைவில்லாமல் விற்று அதற்கேற்ற விலையை மட்டுமே பெற்றனர் என இப்பாடல் வேளாளர்கள் வணிகர்களாகவும் செயல்பட்டனர் என்பது இச்சங்க இலக்கியப் பாடலின் மூலம் தெரிய வருகின்றது. இன்றளவும் வேளாளர்களில் சில பிரிவினர் வணிகத்தொழிலில் சீரும் சிறப்பும் பெற்று விளங்கிவருவது காண்க. இவர்களில் வேளாண் செட்டிகள் என்னும் வகுப்பினர் இன்றளவும் வணிகத்தில் ஈடுபட்டு வருகின்ற வேளாளர் வழிவந்தோர் ஆவர். 
{'\n\n'}தமிழர் நாகரீக முதிர்ச்சிக்கு வழிகோலியவர்கள் வேளாளர்கள். காடு திருத்தி நாடாக்கிக் குளம் தொட்டு வளம் பெருக்கி  இரப்போர்களாகிய அந்தணர்களையும் உலகத்தை காப்பவராகிய அரசர்களையும் தமது வேளாண் தொழிலால் உருவாக்கும் திறமை வாய்ந்தவர்கள் வேளாளர்கள் இதனை இரட்டைக்காப்பியங்களில் ஒன்றான சிலப்பதிகாரத்தில் அதன் நூலாசிரியர் இளங்கோ அடிகள் பின்வருமாறு சுட்டுகின்றார். 
{'\n\n'}
      <Text style={styles.bold}>
”பரப்பு நீர்க் காவிரிப் பாவைதன் புதல்வர்
இரப்போர் சுற்றமும் பரப்போர் கொற்றமும்
உழவிடை விளைப்போர் பழவிறல் ஊர்களும்” {'\n'}
 (சிலம்பு148-50 நாடுகாண்காதை )
      </Text>
{'\n\n'}
உழவுத்தொழிலை உருவாக்கி ஊர்கள் நாடுகள் அரசுகளை உருவாக்கியும் உலகில் நாகரீகத்தை மிளிரச் செய்து அறத்தையும் ஈகையையும் பரவச் செய்தவர்கள் வேளாளர்கள் என்பதை சைவசமயக் குரவர்களில் ஒருவரான ஞானசம்பந்தர் பின்வருமாறு குறிப்பிடுகின்றார்.
{'\n\n'}
      <Text style={styles.bold}>
”வேளாளர்கள்   என்றவர்கள் வள்ளன்மையான் மிக்கிருக்குந்
   தாளாளர் ஆக்கூரிற் றான்றோன்றி மாடமே”
   </Text>
{'\n\n'}இத்தகு பெருமை பெற்ற வேளாளர்கள்   மாந்தர் துன்பம் கொள்ளும் பொழுது தமது பொருள்களையும் சில நேரங்களில் தங்களது உயிரையும் கொடுக்கும் திறன் பெற்றவர்களாக வாழ்ந்தார்கள் இல்லை என்னாது ஈந்து உவக்கும் மக்களாக வாழ்ந்தனர்.  
{'\n\n'}

      </Text>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    backgroundColor: '#fff',
    padding: 16,
    textAlign: 'justify'
  },
  image: {
    width: '100%',
    height: 220,
    borderRadius: 16,
    marginBottom: 16,
  },
  title: {
    fontSize: 22,
    fontWeight: 'bold',
    color: '#047857',
    marginBottom: 12,
    textAlign: 'center',
  },
  content: {
    fontSize: 16,
    color: '#333',
    lineHeight: 26,
    textAlign: 'justify',
    width: 343,
    paddingRight: 6
  },
    bold: {
    fontWeight: '800',
    fontSize: 15,
    fontStyle: 'italic'
  }
});
