// app/vellalar/sangam.tsx
import { ScrollView, Text, View, Image, StyleSheet } from 'react-native';
import BackButton from '@/components/BackButton';

export default function SangamScreen() {
  return (
    <ScrollView style={styles.container} contentContainerStyle={{ paddingBottom: 40 }}>
      <BackButton/>

      <Image
        source={require('@/assets/images/lit.jpeg')}
        style={styles.image}
        resizeMode="cover"
      />

        <Text style={styles.title}>சதுர்வர்ணம்</Text>

        <Text style={styles.content}>
வட இந்தியா போன்று தமிழகத்தில் ஆரியர்களின் சதுர்வர்ண அடிப்படையில் சாதிகள் அமையவில்லை. காரணம் தொன்று தொட்டு தமிழகம் தனித்தியங்கிய அந்நியர்களின் ஊடுருவலுக்கும் பண்பாட்டு சிதைவுகளுக்கும் நீண்ட காலங்கள் தன்னிச்சையான சமூக அமைப்புகளையும் தாய்த்தெய்வ வழிபாடு, மூதாதையர் வழிபாடு லிங்க வழிபாடு, திணைக்கடவுளர்கள் வழிபாடு ஆகியவற்றைக் கொண்டு விளங்கியது.            
{'\n\n'}
          பின்னாளில் குறிப்பாக பல்லவர்கள் ஆந்திரப் பகுதியிலிருந்து தமிழகத்திற்கு மூவேந்தர் ஆட்சி மறைவுக்குப் பின் பொ.ஆ. 350 இல் காஞ்சியைத் தலைநகரமாகக் கொண்டு ஆட்சியைத் தொடங்கினர். இவர்கள் ஆந்திராவில் சாதவாகனர் மற்றும் சாலங்காயனரின் குறுநில மன்னர்களாக இருந்தவர்கள். தங்களை பாரத்வாஜ கோத்திரத்து வழித்தோன்றல்கள் என்றும் பிரம்ம சத்திரியர் என்றும் குறிப்பிடுகின்றனர்.  ஷர்மாக்களாக (வேதங்களில் வல்லவர்) இருந்தவர்கள் வர்மாக்களாக (சத்திரியர்-வீரர்கள்) மாறி தங்களின் பெயர்களுக்குப் பின்னால் வர்மன் என்ற பட்டப்பெயரைத் தாங்கி தமிழகத்தின் தொண்டை மண்டலப் பகுதியை ஆட்சி புரியத் தொடங்கினர். இவர்களின் காலத்தில் தான் தமிழகத்தில் சதுர்வர்ண அமைப்பு படிப்படியாகத் தலைதூக்க ஆரம்பித்தது.  
          {'\n\n'}
          தொல்காப்பியர் கூற்றுப்படி தமிழகத்தில் நான்கு குடிகளில் வேந்தருக்கு அடுத்த நிலையில் வேளாளர் இருந்தனர். வேளாளரே உபரி உற்பத்தியின் விளைவாக வணிகர்களாக மாறினர். இந்நான்கு குடிகளில் குறிக்கப்படும் அந்தணர் என்பவர் தமிழ் கடவுள்களை வழி  நடத்திச் சென்ற பிரிவினர் ஆவர். பல்லவர் காலத்தில் ஆந்திரப் பகுதியில் இருந்து வடமொழி அறிந்த அந்தணர்கள் குடியமர்த்தப்பட்டனர். அவர்களுடைய கோத்திரப் பெயர்களுடனும் சூத்திரப் பெயர்களுடனும் அவர்களின் பூர்விக ஊர்கள் அனைத்தும் ஆந்திரப் பகுதிகளில் உள்ள ஊர்களின் பெயர்களாகவே விளங்கி வருவதைப் பல்லவர்கள் வெளியிட்ட செப்புப்பட்டயங்கள் வழியாக அறிய இயலும். மேலும் ஆரிய அந்தணர்கள் சோழர்காலத்தில் தமிழகத்தின் தென்பகுதிகளுக்குச் சென்று குடியேறினர். 
          {'\n'}
          இவர்கள் தமிழகத்தின் பல கோயில்களில் பணியமர்த்தப்பட்டதுடன் அதுவரை வெள்ளாளர் அனுபவித்த நிலங்கள் பிரமதேயங்களாக மாற்றப்பட்டு நிலங்களின் விளைச்சலில் முதல் உரிமை பெறுபவர்களாக மாறினர். பல்லவர் காலத்தில் தொண்டை மண்டலத்தில் மட்டும் 55 ற்கும் மேற்பட்ட பிரமதேயங்கள் உருவாக்கப்பட்டன. இதே போன்று பாண்டிய நாட்டிலும் பிரமதேயங்கள் உருவாக்கப்பட்டன. தமிழகத்தின் முதல் பிரமதேயம் பொ.ஆ. 300 அளவிலேயே உருவாக்கப்பட்டதை புதுக்கோட்டை மாவட்டம் பொன்னமராவதி அருகிலுள்ள பூலாங்குறிச்சி கல்வெட்டு குறிப்பிடுகின்றது.  வேளாளர்கள் பரவலாக தமிழகத்தின் பல்வேறு பகுதிகளுக்கு குடிபெயர்ந்தமைக்கு காரணமாக தொண்டை மண்டலத்தில் பிரமதேயங்கள் உருவாக்கப்பட்டதும் பிற பகுதிகளில் வேளாண்மையை விரிவுபடுத்துவதற்காகவும் குடிப்பெயர்ச்சி ஏற்பட்டது எனலாம்.
          {'\n'}
         இலங்கையிலும் இரும்புக்காலம் அல்லது பெருங்கற்கால கட்ட த்தில் வேளாண் மக்கள் தமிழகத்திலிருந்து குடியேறினர் எனப் பேராசிரியர் பத்மநாதன் கருதுகின்றார். இலங்கையில் வேளா என்ற பெயர் அங்கு கிடைக்கின்ற பிராமிக் கல்வெட்டுகளில் விரவி வருகின்றது. மேலும் வேளான் என்ற பெயர் பொறித்த மட்கல ஓடு ஒன்று இலங்கை பூநகரிப் பகுதியில் பரமன்கிராய் என்னும் இடத்தில் கிடைத்துள்ளது. இது வேளாளரைக் குறிக்கும் சொல்லாகும். 
          {'\n\n'}
         மேலும் 11-12 ஆம் நூற்றாண்டில் தான்  சாதிய அமைப்புகளும் வலங்கை இடங்கைப் பிரிவுகளும் தமிழகத்தில்  தோற்றம் பெற்றன. அதுவரை தொழில் சார்ந்த குடிகளாகவே தமிழர்கள் வாழ்ந்து வந்தனர் என்பதை சான்றுகளின் அடிப்படையில் பல தமிழக ஆய்வாளர்கள் மட்டுமன்றி வெளிநாட்டு அறிஞர் பெருமக்களும் நிறுவியுள்ளனர். 
        </Text>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    backgroundColor: '#fff',
    padding: 16,
    textAlign: 'justify'
  },
  image: {
    width: '100%',
    height: 220,
    borderRadius: 16,
    marginBottom: 16,
  },
  title: {
    fontSize: 22,
    fontWeight: 'bold',
    color: '#047857',
    marginBottom: 12,
    textAlign: 'center',
  },
  content: {
    fontSize: 16,
    color: '#333',
    lineHeight: 26,
    textAlign: 'justify',
    width: 343,
    paddingRight: 6

  },
});
