// app/vellalar/social.tsx
import { ScrollView, Text, View, Image, StyleSheet } from 'react-native';
import BackButton from '@/components/BackButton';

export default function SocialScreen() {
  return (
<ScrollView style={styles.container} contentContainerStyle={{ paddingBottom: 40 }}>     
  <BackButton/>
   <Image
        source={require('@/assets/images/samooga.jpg')}
        style={styles.image}
        resizeMode="cover"
      />

      <Text style={styles.title}>வேளீர்-வேளாளர்</Text>

      <Text style={styles.content}>
	பொதுவாக வரலாற்று ஆசிரியர்கள் மேற்சொன்னபடி சங்க காலத்தில் குறுநில மன்னர்களாகவும் வேந்தர்களுடன் மண உறவு பூண்டவர்களாகவும் விளங்கிய வேளீர் மரபினர் வேளாளர்களாவர் எனக் கருதுகின்றனர். மருத நிலத் தலைமக்களும் வேளாண் பண்பாட்டுத்  தலைவர்கள் வேந்தர் என்ற  தகுதி பெற்றனர் என பேராசிரியர் மாதையன் குறிப்பிடுவார். எனவே  வேந்தர்களுக்கு இணையாக வேளீர்கள் போற்றப்பட்டனர். முதுகுடியான வேளாள மன்னர்கள் கோட்டைகளைக் கட்டி வாழ்ந்தனர். இதன் வழியாகவே தொண்டைமண்டலத்தில் உள்ள கோட்டைகளின் அமைப்பில் கோட்டங்கள் என்ற நாட்டுப் பிரிவு முதலில் தமிழகத்தில் தோன்றுகிறது. இம்மண்கோட்டைகளின் எச்சங்கள் 18 ஆம் நூற்றாண்டுவரை இருந்துள்ளமையை மெக்கன்சி குறிப்புகளின் மூலம் அறியலாம். ஐரோப்பிய நாடுகளில் இடைக்காலத்தில் இருந்த நிலப்பிரபுக்கள் போன்ற தனித்துவம் பெற்றவர்களாக தமிழக  வேளீர்கள் விளங்கினர் என ஆய்வாளர்கள் கருதுவர். சிறிய பகுதிகளை ஆட்சி செய்பவர்களாக இருப்பினும் அப்பகுதியில் தன்னிச்சையான சுதந்திரமான ஆட்சியை வேளீர்கள் செய்துவந்தனர். 
        {'\n\n'}
வேளீர்கள் சிறு சிறு பகுதிகளில் தன்னாட்சி பெற்ற  அரையர்களாக விளங்கினாலும் தங்களை வேளாளர் சமூகத்தின் வழித்தோன்றல்கள் என்பதை அடையாளப்படுத்தி வந்தனர். மிழலைக்கூற்றம் மற்றும் முத்தூற்றுக்கூற்றம் என்னும் பகுதி பாண்டிய நாட்டிற்கும் சோழ நாட்டிற்கும் இடையில் இருந்த இருகூற்றங்களாகும் கீழைக்கடற்கரையை ஒட்டி இப்பகுதிகள் வளமிக்க வயல்களைக் கொண்டு விளங்கியது. இக்கூற்றங்களில் தொன்முதிர் வேளீர்கள் வாழ்ந்தனர். தொன்மை மிக்க குடிகளாக வேளாளர்கள்  நெல்லைப் பயிரிட்டு செல்வச் செழிப்புடன் வாழ்ந்தனர் என மாங்குடி மருதனார் குறிப்பிடுகின்றார். இப்பகுதியின் தலைவனாக பெருவேள் எவ்வி என்னும் வேளீர் தலைவன் ஆட்சி புரிந்தான். 
        {'\n\n'}
 	வேளாளர்களின் நிலத்தில் பணிபுரியும் உழுகுடிகள் இருந்தனர். நில உடமையாளர்களான வேளாளர்கள் மேல்வாரம் பெற்றவர்களாகும் உழுகுடிகள் குடிவாரம் பெற்றவர்களாகவும் இருந்தனர். இவர்கள் கீழ்குடிகள் அல்லது வீழ்குடிகள் எனப்பட்டனர்.  தமிழகத்தில் தொன்று தொட்டு தொன்மையான வேளாண் சமூகம் வேளீர் வழி வந்த உயர் வகுப்பாகவே கருதப்பட்டனர்.  எனவே நால்வகை சமூக கட்டமைப்பிலிருந்து வேளாளர்கள் தனித்து வழிவழித் தலைமைப் பண்புகளைக் கொண்டவர்களாகவே விளங்கினர். இவர்கள் நில உடைமையாளர்களாகவும் தனிப்படைகள் உடைய போர் வீரர்களாகவும் இருந்தனர். தொடக்க காலத்தில் வேளீர் மரபினர் வேந்தர்களுக்கு தங்களது பெண்களை மணம் முடித்து வைத்தனர். வேந்தர்களும் பெண் எடுக்க உயர்நிலையில் இருந்த வேளீர்களை அணுகினர். கரிகால் பெருவளத்தான் அழுந்தூர் வேளீர் மகளைத் திருமணம் செய்து கொண்டார். பெண்வழி அல்லது தாய்வழி வேளீர் மரபினர் ஆயினர்.
          {'\n\n'}
 	காஞ்சிபுரத்தில் தான் ஆட்சிக் கட்டில் ஏறியபொழுது இப்பகுதியில் இருந்த வேளாளர்களுக்கு ஊக்கம் அளிக்கும் வகையில் கரிகாற்சோழன் காடுதிருத்தி வேளாண் நிலங்களைப் பெருக்கினான்.  பிற்காலத்தில் வேந்தர்கள் தங்களது பெண்களை வேளீர் வழி வந்தவர்களுக்கு பெண் கொடுத்தனர். இதன் மூலம் வேளீர் வேளாளர் சமூகத்தில் உயர் நிலையில் இருந்தனர் என்பது புலப்படும். அரசத் தகுதியில் வேளாளர்கள் இருந்தமையால் படைக்கலப் பயிற்சியும் பெற்று சிறந்த வீரர்களாக விளங்கினர். வேளாளப் படை அல்லது வேள்படை என்பதின் பொருளிலும் வேளாளர் என அழைக்கப்பட்டனர் என சில ஆய்வாளர்கள் கருதுவர். பிற்காலத்தில் வேளாளர்களுக்குள் படை அமைப்பும் தோற்றம் பெற்றது.
          {'\n\n'}
வேளீர் மரபில் பல சிற்றரசர்கள் தமிழகத்தில் குறிக்கப்படுகின்றனர்.  தகடூரை ஆண்ட அதியன் மரபினர், முன்சொல்லப்பட்ட நவிர மலை நன்னன், திருஆவினன் குடி (பழனி) ஆவியர், ஓய்மா நாட்டு ஓவியர், மையூர் கிழான் வேள்மான், வெளியன் வேள்மான்,	 புடவூர் வேள்மான், நெடுவேள் ஆதன்,  கூடல் வேள், உறந்தை வேள், கொங்கு வேள்,  பாரி வேள், மற்றும் திருவனந்தபுரம் பகுதியில் வாழ்ந்த ஆய்குடி ஆய்வேள் மரபினர் போன்றோர் சங்க கால வேளீர் மரபினர் ஆவர். பிற்காலத்தில் கொடும்பாளூர் இருக்கு வேளீர், துவரை என்ற பகுதியை ஆண்ட இருங்கோவேள் வேளீர் மரபினர் ஆவர். கருவூர் பகுதியில் இருந்த வஞ்சி வேள்,காவேரிப் பகுதியில் இருந்த அழுந்தூர் மற்றும் நாங்கூர்  பகுதிகளில் வேளீர்கள் ஆட்சி செய்தனர்.  இவர்களை அடுத்து பல்லவர் மற்றும் சோழர் காலத்தில் வாணர், கங்கர், பழுவேட்டரையர் ஆகியோரும் வேளீர் வழி வந்தவர்கள் எனக் கூறுகின்றனர்.  ஆய்வாளர்கள் சிலர் குறிப்பாக இராகவ அய்யங்கார் வேளீர்களை யதுகுல கண்ணன் வழி வந்த கால்நடை மேய்க்கும் யாதவர்களாக அடையாளப்படுத்துவர். இது முற்றிலும் தவறு. இதனை  மு. அருணாசலம் அவர்களும் தக்க சான்றுகளுடன் மறுத்துள்ளார்.
      </Text>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    backgroundColor: '#fff',
    padding: 16,
    textAlign: 'justify'
  },
  image: {
    width: '100%',
    height: 220,
    borderRadius: 16,
    marginBottom: 16,
  },
  title: {
    fontSize: 22,
    fontWeight: 'bold',
    color: '#047857',
    marginBottom: 12,
    textAlign: 'center',
  },
  content: {
    fontSize: 16,
    color: '#333',
    lineHeight: 26,
    textAlign: 'justify',
    width: 343,
    paddingRight: 6
  },
});
