// app/vellalar/gangai-amman.tsx
import { ScrollView, Text, View, Image, StyleSheet } from 'react-native';
import BackButton from '@/components/BackButton';
export default function VaanaaScreen() {
  return (
    <ScrollView style={styles.container} contentContainerStyle={{ paddingBottom: 40 }}>
<BackButton/>
      <Image
        source={require('@/assets/images/ganga.jpg')}
        style={styles.image}
        resizeMode="cover"
      />

      <Text style={styles.title}>வாணாதிராயர்கள்</Text>

      <Text style={styles.content}>
	மேற்குறித்தபடி பழைய வடஆற்காடு மாவட்டம், சித்தூர், கோலார் பகுதிகள் வாணகோப்பாடி அல்லது பெரும்பாணப்பாடி என வழங்கப்பட்டது. சங்க இலக்கியங்களில் இப்பகுதி மிகப் பெரும் பகுதியாக விளங்கியதை அகநானூற்றில் மாமூலனார் குறிப்பிடுகின்றார். அதியமானுடைய தகடூருக்கு (தருமபுரி) வடக்கு மற்றும் கிழக்குப் பகுதிகளில் இது அமைந்திருந்தது. வாணாதிராயர்களின் தலைநகரமாக ஷிரா நதி எனப்படும் பாலாற்றின் கரையில் அமைந்துள்ள திருவல்லம் என்னும் ஊர் அமைந்திருந்தது.  திருவல்லம் தேவாரப் பாடல் பெற்ற தலமாகும். இப்பகுதி பண்டைத்தமிழகத்தின் வட எல்லையில் அமைந்திருந்தமையால் வீர வேளாள மரபில் வந்த வாணர் குலத்தவர் பல்லவர்களுக்குப் பின்னர் வந்த சோழர்களுக்கும் தக்க படைகளை அளித்து எல்லையைக் காத்தனர். இவர்கள் தங்களை மகாபலி வழி வந்தவர் என்றும் கங்கைகுலத்தவர் என்றும் குறிப்பிடுகின்றனர். 
        {'\n\n'}
	சங்க இலக்கியங்களில் இப்பகுதியில் வேளாளர்கள் காடு திருத்தி உழு நிலங்களை   உருவாக்கியமை வெகுவாகப் பேசப்படுகின்றன.  இப்பகுதி வடக்குப்பகுதியில் இருந்தமையால் வடுக வழி மேற்கு என்றும் வடுகவழி பன்னீராயிரம் என்றும் அகநானூறு குறிப்பிடுகிறது. வெப்ப மிகுதியால் இப்பகுதியின் நிலங்கள் கோடையில் வறண்டு காணப்பட்டதாகவும் வெப்பத்தின் விளைவால் நிலத்தின் பயிர்கள் கருகிக் காய்ந்து தீய்ந்து அழிந்ததாகவும் கால்நடைகளும் வெப்பத்தால் உணவின்றி மாய்ந்தாகவும் சங்க இலக்கியங்கள் குறிப்பிடுகின்றன. வாணர்கள் வாழ்ந்த பகுதி வாணர் சிறுகுடித்தண்டலை எனப்பட்டது. சோலைகளின் அருகில் செந்நெல் விளைகின்ற வயல்கள் இருந்தன.  வாணர், பாணர், வாணாதிராயர், வாணவரையர் எனப் பலவாறாக இவர்கள் அழைக்கப்பட்டனர்.  நிலத்தை பண்படுத்தி வேளாண்மைக்கு ஏற்றவாறு உருவாக்கி அவற்றை பிரித்தளந்து வேளாண்மையைப் பெருக்கியமையின் காரணமாக மகாபலி வழி வந்தவர் எனத் தங்களை அழைத்தனர்.  வாணாதிராயர்கள் தமிழகத்தின் பல்வேறு பகுதிகளுக்குச் சென்று சிற்றரசர்களாகவும் வேளாண் மக்களாகவும் வாழ்ந்து சிறப்பித்தனர். இதனை பின்னர் வரும் பகுதிகளில் பார்ப்போம்.
        {'\n\n'}
       </Text>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    backgroundColor: '#fff',
    padding: 16,
    textAlign: 'justify'
  },
  image: {
    width: '100%',
    height: 220,
    borderRadius: 16,
    marginBottom: 16,
  },
  title: {
    fontSize: 22,
    fontWeight: 'bold',
    color: '#047857',
    marginBottom: 12,
    textAlign: 'center',
  },
  content: {
    fontSize: 16,
    color: '#333',
    lineHeight: 26,
    textAlign: 'justify',
    width: 343,
    paddingRight: 6
  },
});
