// app/vellalar/gangai-amman.tsx
import { ScrollView, Text, View, Image, StyleSheet } from 'react-native';
import BackButton from '@/components/BackButton';
export default function VendharScreen() {
  return (
    <ScrollView style={styles.container} contentContainerStyle={{ paddingBottom: 40 }}>
<BackButton/>
      <Image
        source={require('@/assets/images/ganga.jpg')}
        style={styles.image}
        resizeMode="cover"
      />

      <Text style={styles.title}>வேளாளர்கள்- வேந்தர்கள்</Text>

      <Text style={styles.content}>
வேளாளர்கள் சங்க காலத்தில் வேளிர்களாக அரசாட்சி செய்ததுடன் மூவேந்தர்களுடன் மண உறவு கொண்டவர்களாகவும் விளங்கினர். இதன் மூலம் சமூகத்தில் சிறப்பான இடத்தைப் பெற்றுத் திகழ்ந்தனர். பிற்காலத்தில் வேளாளர்கள் நான்கு வர்ண (சதுர்வர்ணம்) அமைப்பு தமிழகத்தில் ஏற்பட்ட பின்பு சூத்திரர்களாக கருதப்பட்டது வரலாற்றை அறியாதவர் செய்த பிழையாகும். வேளாண்மை மட்டுமன்றி மிகச் சிறந்த போர்வீரர்களாகவும் அரசியல் வித்தகர்களாகவும் நாட்டுப் பிரிவின் தலைவர்களாகவும், வணிகர்களாகவும் வேளாளர்கள் விளங்கினர். அரச மரபைப் பொறுத்த வரை அரசர் எக்குலத்திலும் பெண் எடுக்கும் உரிமையை பெற்றவராக விளங்கினார். அரசர்கள் உயர்ந்தவர்களாகக் கருதப்பட்டதால் அவ்வுரிமையை எவரும் தடுக்க இயலாது நிலை இயல்பானது. எடுத்துக்காட்டாக சோழ அரசர்கள் குறுநில மன்னர்களிடம் மட்டுமன்றி பிற அரச மரபுகளின் குறிப்பாக சேரர்கள், இராட்டிர கூடர்கள், கங்கர்கள், சாளுக்கியர்கள் போன்ற அரச மரபுகளுடனும் மண உறவு பூண்டனர். வேளாளர்கள் அல்லது வேளிர் மரபினர் அரச மரபுகளுக்கு இணையாக இருந்தமையால் தங்களின் பெண்களை வேளாள மரபினருக்கு மணம் முடித்துக் கொடுத்தனர்.  எடுத்துக்காட்டாக மணிமேகலையில் குறிக்கப்பெறும் சோழன் நெடுங்கிள்ளியின் மனைவியும் இளவரசர் உதயகுமாரனின் அன்னையான ’சீர்த்தி’ என்பவள் வாணர்குலத்தில் மகாபலியின் வழி வந்தவள் ஆவாள்.
    {'\n\n'}
      <Text style={styles.bold}>
“மாவலி மரபோன் சீர்கெழு திருமகள்
சீர்த்தி என்னும் திருத்தகுதேவி” 
</Text>
    {'\n'}
என இவ்வம்மையாரை மணிமேகலைக் குறிப்பிடுகிறது.
    {'\n\n'}
வாணர் அல்லது வாணாதிராயர் வழி வந்த வல்லத்து அரையன் வந்தியத் தேவனை முதலாம் இராஜராஜனின் தமக்கையார் குந்தவை மணம் முடித்தமையை இங்கு சுட்டலாம். எனவே முடியுடை வேந்தர்களுக்கு இணையாக கருதப்பட்ட மரபினராக வேளாளர்கள் விளங்கினர்.
    {'\n\n'}
       </Text>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    backgroundColor: '#fff',
    padding: 16,
    textAlign: 'justify'
  },
  image: {
    width: '100%',
    height: 220,
    borderRadius: 16,
    marginBottom: 16,
  },
  title: {
    fontSize: 22,
    fontWeight: 'bold',
    color: '#047857',
    marginBottom: 12,
    textAlign: 'center',
  },
  content: {
    fontSize: 16,
    color: '#333',
    lineHeight: 26,
    textAlign: 'justify',
    width: 343,
    paddingRight: 6
  },
    bold: {
    fontWeight: '800',
    fontSize: 15,
    fontStyle: 'italic'
  }
});
