// app/vellalar/warriors.tsx
import { ScrollView, Text, View, Image, StyleSheet } from 'react-native';
import BackButton from '@/components/BackButton';
export default function WarriorsScreen() {
  return (
   <ScrollView style={styles.container} contentContainerStyle={{ paddingBottom: 40 }}>
      <BackButton/>
      <Image
        source={require('@/assets/images/cow.jpg')}
        style={styles.image}
        resizeMode="cover"
      />

      <Text style={styles.title}>கொடும்பாளூர் வேளீர் </Text>

      <Text style={styles.content}>
வேளீர்கள் வேளாளர்களே என்பதற்கு மிகச் சிறந்த சான்று கொடும்பாளூரைத் தலைநகரமாகக் கொண்டு ஆட்சி புரிந்த  வேளீர் வழி வந்தவர்கள், சோழர்களுடன் மணவுறவு வைத்திருந்தனர். சங்க இலக்கியத்தில் இருங்கோவேள் மரபினர் குறிக்கப்படுகின்றனர். துவாரபதியில் இருந்து பதினெண் குடி வேளீர் மற்றும் அருவாளர்கள் தமிழகத்திற்குப் புலம் பெயர்கின்றனர். இவர்கள் முதலில்  காடு கெடுத்து நாடாக்குகின்றனர். ஔவை சு. துரைசாமிப் பிள்ளை அவர்கள் இவர்கள் முதலில் கருநாடகப் பகுதிக்கு வந்து அங்கிருந்து கங்க நாடு கொங்கு நாடு வழியாக தொண்டை நாடு வந்து அப்பகுதியை ஆண்ட பின் தென்பகுதியான கொடும்பாளூர் வந்தடைந்தனர் என்பார். இவர்களை  சில ஆய்வாளர்கள் யதுகுலத்தார் எனவும் கூறுவர்.காரணம் துவராபதியின் கண்ணன் இவர்களுக்கு உதவி புரிந்தமையால் இதனை இவர்கள் போற்றியிருக்கலாம். 
        {'\n'}{'\n'}
மேலும் ஏற்கனவே கூறியது போன்று வேளாளர்களின் செல்வம் கால்நடைகளும் ஆகும். வேளாண்மைக்கு முதன்மையானது கால்நடைகளும் ஆகும்.சமூக அமைப்பில் முதலில் மேய்த்தல் தொழில் தோன்றிய பின்பே வேளாண்மை உருவாகிறது(Agro-pastoral). எனவே கால்நடைச்சமூக அமைப்பில் வேளாண்மைக்கு வித்திட்டவர்கள் வேளாளர் ஆகின்றனர். எனவே யதுகுலக் கண்ணனை தங்களது வழிகாட்டியாக ஏற்றனர்.
        {'\n'}{'\n'}
கொங்கு வேளாளர் குலப் பெயர்களில் கண்ணன், கண்ணந்தை கூட்டங்கள்  உள்ளன. இவர்கள் கண்ணனை தங்களின் கடவுளாக வணங்கி வருகின்றனர். ஆந்தைக் கூட்டமும் கண்ணன் குலமும் சேர்ந்து கண்ணந்தைக் குலம் உருவானது. கண்ணன் என்ற பெயர் செங்கடல் பகுதியில் கிடைத்த பானைப் பொறிப்பிலும் காணப்படுகிறது. இவர் கொங்குப் பகுதியிலிருந்து சென்ற வேளாள-வணிகராக இருக்கலாம். எனவே வேளாளர்கள்  யதுகுல கண்ணனைப் போற்றினர். கொடும்பாளூர் வேளீர் மன்னர் இருங்கோவேள் ஆண்ட பகுதி இன்றைய பட்டுக்கோட்டை, அறந்தாங்கி, புதுக்கோட்டை, திருமெய்யம், மணமேற்குடி,  ஆகியவை அடங்கிய பகுதியாகும் இது சங்க காலத்தில் மிழலைக்கூற்றம் எனப்பட்டது. இதனை  புறப்பாடல் ஒன்று
        {'\n'}{'\n'}
      <Text style={styles.bold}>
”ஓம்பா ஈகை மாவண் கிள்ளி
புனலம் புதவின் மிழலை” எனக் குறிக்கும்.
</Text>
        {'\n'}{'\n'}
பொன்னமராவதிக்கு அருகில் உள்ள பழமையான பூலாங்குறிச்சிக் கல்வெட்டில் மிழலைக்கூற்றம் குறிக்கப்பட்டுள்ளது. இப்பகுதியில் இன்றளவும் வேளாளர் இனமான பிள்ளைப்பட்டம் உடையோர் பெருமளவில் வாழ்கின்றனர். கொடும்பாளூர் கோயில் முசுகுண்டேஸ்வரர் என்னும் பெயரில் வழங்கப்படுகிறது. கொடும்பளூர் வேளீர்களின் குல தெய்வமாக இவர் விளங்கினார். சோழர்களுடன் மணவுறவு கொண்டவர்கள் கொடும்பாளூர் வேளீர் இனத்தவர்.  எனவே சோழநாட்டில் இவர்கள் செல்வாக்கு மிக்கவர்களாக வாழ்ந்தனர். இன்றும் வேளாளப் பிரிவுகளில் முசுகுந்த வேளாளர் பிரிவு தஞ்சையின் பட்டுக்கோட்டைப் பகுதியில் பெருமளவில் வசிக்கின்றனர். கொடும்பாளூர் முசுகுந்தேஸ்வரர் பெயரால் இப்பெயர்ஏற்பட்டிருத்தல் வேண்டும். அதன்படி முசுகுந்தன் என்னும் மன்னர் வழியில் முசுகுந்த நாடும் பெருமைபெற்றது. திருச்சி, புதுக்கோட்டைப் பகுதிகளிலும் இவர்கள் வாழ்ந்து வருகின்றனர்.
        {'\n'}{'\n'}
தொடர்ந்து பிற்காலக் கல்வெட்டுகளில் மிழலைக் கூற்றம் சொல்லப்படுகிறது. கொடும்பாளூர் வேளீர் வழியைச் சேர்ந்தவர் பெரியபுராணத்தில் குறிக்கப்பெறும் இடங்கழி நாயனார் ஆவார். கொடும்பாளூரைத் தலைநகரமாகக் கொண்டு பூதி விக்கிரமகேசரி என்பவர் ஆட்சி செய்தார். மேலும் சோழர்களின் உயர் அலுவலர்களாகவும் பணியாற்றினர். அவர்களுள் குறிப்பிடத்தக்கவர் பராந்தகன் சிறிய வேளாண். பல்லவர் காலத்தில் எழுச்சி பெற்றிருந்த கொடும்பாளூர் வேளீர்கள் தன்னிச்சையான சிற்றரசர்களாக விளங்கினர். பூதி விக்கிரமகேசரி என்னும் மன்னன் பல்லவர் காலத்தில் மிகச் சிறந்த மன்னனாக விளங்கினான். இவர்கள் இருக்குவேள், இளங்கோவேள் என்ற பட்டங்களைப் பெற்றனர். 
        {'\n'}{'\n'}
சோழர் காலத்தில் முதலாம் சுந்தரசோழன் காலத்தில் பராந்தகன் சிறிய வேளான் என்பவர் உயர் அலுவலராக பணியாற்றினார். சிறிய வேளானில் என்பது முன்பு கூறப்பட்ட இவர்கள் பெற்றிருந்த இளங்கோ என்னும் முன்னொட்டைப் பட்டத்தைப் அடியொற்றி வந்திருக்கலாம்.  வேள் என்பது வேளார் ஆயிற்று.   இவர் இராஜராஜனின் தந்தையார் சுந்தர சோழனின் ஆட்சியில் படைத்தலைவராக இருந்து இலங்கையில் 965 இல் நடந்த போரில் வெற்றி பெற்று உயிர் துறந்தார். கல்வெட்டில் இவர் ஈழத்துப் பட்ட கொடும்பாளூர் வேளாண் சிறிய வேளாண் என அழைக்கப்படுகின்றார். இவரது மகன் இராஜராஜன் காலத்தில் பணியாற்றுகின்றார். இவர் வேளாண் சுந்தர வேளாண் என அழைக்கப்பட்டார். 
        {'\n'}{'\n'}
இவர்களைப் பற்றிக் குறிப்பிடும்பொழுது இருங்கோவேள் மரபுக்கு விளக்குப் போன்றவனும் பிராந்தக அரசனின் மகள் வழி மரபில் (பிராந்தகஸ்ய ஆத்மஜ வர்க வர்கய) முதன்மைப் பெற்றவன் எனவும் புகழப்படுகின்றான். முதலாம் பராந்தக சோழனின் மகள் அனுபாமா கொடும்பாளூர் வேளீர் சமராபிராமன் என்பவரை மணந்தார். அதேபோன்று கொடும்பாளூர் வேளீர்கள் தங்களது மகள்களை சோழர்களுக்கு மணம் முடித்து வைத்தனர். கொடும்பாளூர் வேளீர் வழி வந்த சைவ சமயக் குரவர்களில் ஒருவரான இடங்கழிநாயனாரை நம்பியாண்டார் நம்பியும் சேக்கிழார் பெருமானும் ஆதித்தன் குல முதல்வன் எனக் குறிப்பிடுவார்.
        {'\n'}{'\n'}
மேலும் திருவாரூர் பகுதிக்கு கிழக்கிலும் மன்னார்குடிப் பகுதிக்கு தெற்கிலும் அமைந்த பகுதி வேளா நாடு என சோழர் காலத்தில் வழங்கப்பட்டது. இது சத்திரிய சிகாமணி வளநாட்டில் இருந்தது. இப்பகுதியில் கார்காத்த வேளாளர்கள் இன்றளவும் பெருமளவில் வசித்து வருகின்றனர்.  தாழி குமரன் என்னும் சோழ அலுவலர் ஒருவர் சத்திரிய சிகாமணி வளநாட்டின் வேளார் நாட்டைச் சார்ந்த சிறுகூற்ற நல்லூர் கிழவனாவன் (கிழார்- வேளாளர்). இவர் இலங்கையில் மாதோட்டத்தில் சிவாலயம் ஒன்றை எழுப்பி அதற்கு கொடைகள் வழங்கியதை இலங்கை மாதோட்டத் தமிழ்க் கல்வெட்டு தெரிவிக்கின்றது. 
        {'\n'}{'\n'}
பொதுவாக சோழர் கல்வெட்டுகளில் உடையான் பட்டம் வேளாளர்களுக்கே உரித்தானது என்பதை பேராசிரியர்கள் கராஷிமா, சுப்புராயலு போன்ற அறிஞர்கள் குறிப்பிட்டுள்ளனர். நில உடைமையாளராக இருந்தவர்கள் காணி உரிமைப் பெற்றவர்களே உடையார் பட்டத்தைப் பெற்றிருந்தனர். எனவே நிலத்தை உரிமையுடையவர்களான வேளீர்கள் வேளாளர்களின் முன் தோன்றல்களே.
        {'\n'}{'\n'}
வேள் என்ற பெயர் சங்க இலக்கியங்களில் விரவி வந்துள்ளது இவர்கள் வணிகத்தையும் மேற்கொண்டனர். ஏற்கனவே சொன்னது போன்று விளைச்சல் சார்ந்த வாணிகத்தை மேற்கொண்ட கூல வாணிகர். தமிழிக் கல்வெட்டுகளில் வேள்ளறை நிகமத்தோர் வேள் காசிபன் போன்ற பெயர்கள் உள்ளன. வேளாளர்களே வணிகத்தில் பிற்காலத்திலும் ஈடுபட்டனர் என்பதற்குப் பல சான்றுகள் உள்ளன. வேளான் செட்டி என்போர் இவ்வரிசையில் வந்தவர்களே. தமிழகத்தில் கிடைக்கின்ற பழமையான தமிழிக் கல்வெட்டுகளில் வேள் வணிகக் குழுக்களுடன் இணைந்து சொல்லப்படுகிறது. காவிதி, ஏனாதி போன்ற பட்டங்களைப் பொதுவாக நிலத் தொடர்புடைய நில உரிமையாளர்களுக்கு அரசன் அளித்தார். காவிதி என்ற பெயர் கர்நாடகத்தில் இன்றளவும் உள்ள கவுடா எனப்படும் சாதியர் வைக்கும் பட்டம் என ஐராவதம் மகாதேவன் கருதுவார். கவுடா மரபினர் இன்றளவும் கர்நாடகத்தின் வேளாள மரபினரே. அரிட்டாபட்டி தமிழிக் கல்வெட்டில் வேளீர்களின் மாற்று வடிவமான வொளியன் என்ற பெயர் உள்ளது. மேலும் கொங்குப் பகுதியிலுள்ள கொடுமணல் அகழாய்வில் வேளாளர் தொடர்பான பெயர்கள் பல விரவி வருகின்றன. கொற்றந்தை, ஆதன், அந்துவன், கண்ணன், ஆந்தை, சாத்தன், வேள் போன்ற பெயர்கள் உள்ளன.
        {'\n'}{'\n'}
இலங்கைக் கல்வெட்டுகளிலும் வேள் குறித்து பல கல்வெட்டுகள் குறிப்பிடுகின்றன. இலங்கையில் இவர்கள் இன்றளவும் வேளாள மரபினராகவே அடையாளப் படுத்தப்பட்டு வருகின்றனர். வேளாளர் வாழ்ந்த பகுதிகள் பெரும்பாலும் வேள்+ ஊர்  என்ற பெயரில் அமைந்தன.  தேனி மாவட்டத்தில் வேள் ஊர் என்ற பெயரில் ஊர் ஒன்று இருந்துள்ளதை பொ.ஆ. மு. 500 ஐச் சார்ந்த நடுகல் ஒன்று குறிப்பிடுகின்றது. அதே போன்று பூலாங்குறிச்சிக் கல்வெட்டில் வரும் வேட்கூறு என்ற ஊர் வேள்+கூறு என்பதின் கூட்டாக இருக்கலாம்.  வேலூர் மாவட்டத்தில் நாட்டுப் பிரிவுகள் வேளாளர் பெயரில் அமைந் திருந்ததை முன்னறே கண்டோம்.
        {'\n'}{'\n'}
 	சோழர்கள் காலத்தில் வருவாய் மற்றும் படைப்பிரிவுகளில் வேளாளர்கள் தலைமை பொறுப்பில் ஈடுபட்டனர். குறிப்பாக மூவேந்த வேளாண் என்னும் உயர் அதிகாரிகள் வேளாளர் மரபில் வந்தவர்கள்.   மேலும் அரசவையில் திருமந்திர ஓலை நாயகர்களாக (இன்றைய தலைமைச் செயலர்) மத்தியஸ்தர்களாக (நீதிபதிகள்) கோயில் அதிகாரிகள் என பல உயர் அலுவலர்களாக வேளாளர்கள் செயல்பட்டனர். சோழர் காலத்தில் பல உயர் பதவிகளில் வேளாளர்கள் இடம்பெற்றதை ஆரோக்கியசாமி பட்டியலிடுவார்.  சோழர் காலத்தில் வேளாளர் பிரிவைச் சார்ந்த விழுப்பதரையன், பல்லவதியரையன், முனையதரையன், காலிங்கராயன் போன்ற உயர் அலுவலர் படைப்பிரிவின் தளபதிகளாகச் செயல்பட்டதை பல்வேறு கல்வெட்டுகள் தெரிவிக்கின்றன.  படைப்பிரிவின் தலைமைப் பொறுப்பிலிருந்து வரலாற்றில் இடம் பெற்ற சில தலைமைத் தளபதிகள் குறித்து பிறிதொரு இயலில் பார்ப்போம். நாடு என்ற அரசுப் பிரிவின் உள்ளூர் நிருவாகத்தை வேளாளர் எனப்படும் நாட்டார் ஆளுமை செலுத்தினர் என்பதை பல்லவர் சோழர் கால கல்வெட்டுகளின் மூலம் உறுதி செய்யலாம்.
{'\n'}{'\n'}

      </Text>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    backgroundColor: '#fff',
    padding: 16,
    textAlign: 'justify'
  },
  image: {
    width: '100%',
    height: 220,
    borderRadius: 16,
    marginBottom: 16,
  },
  title: {
    fontSize: 22,
    fontWeight: 'bold',
    color: '#047857',
    marginBottom: 12,
    textAlign: 'center',
  },
  content: {
    fontSize: 16,
    color: '#333',
    lineHeight: 26,
    textAlign: 'justify',
    width: 343,
    paddingRight: 6
  },
    bold: {
    fontWeight: '800',
    fontSize: 15,
    fontStyle: 'italic'
  }
});
